[
  {
    "Id": 10687,
    "Name": "Jouluglögi",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10687?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Mittaa vesi ja mausteet kattilaan ja keitä noin 5 minuuttia.\n# Lisää mehut ja kuumenna kiehuvaksi.\n# Siivilöi juomasta mausteet pois ja tarjoa glögi kuumana rusinoiden tai karpaloiden sekä manteleiden kanssa.",
    "Ingredients": "vettä\ntuoretta inkivääriä\nkanelitanko\nkardemummaa\npomeranssin kuorta\nPirkka mustaherukkamehutiivistettä\nPirkka omenatäysmehua\nrusinoita\nmanteleita"
  },
  {
    "Id": 10628,
    "Name": "Gluteeniton perunalaatikko",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10628?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Keitä perunat kuorineen kypsiksi. Älä lisää suolaa keitinveteen.\n# Kuori perunat ja survo ne sileäksi soseeksi. Sekoita joukkoon siirappi.\n# Mittaa kattilaan maito ja voi, kuumenna kunnes voi on sulanut. Lisää suola ja muskottipähkinä.\n# Sekoita maito perunasoseen joukkoon ja kaada seos voideltuun uunivuokaan (tilavuus 2 l).\n# Paista 150-asteisessa uunissa hieman keskitasoa alemmalla tasolla 2-2 ½ tuntia. Peitä pinta leivinpaperilla, jos se tummuu liikaa.",
    "Ingredients": "jauhoisia perunoita  (punainen pussi)\ntummaa siirappia\nPirkka täysmaitoa\nvoita\nsuolaa\njauhettua muskottipähkinää"
  },
  {
    "Id": 10627,
    "Name": "Irish coffee -juustokakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10627?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Hienonna keksit monitoimikoneessa tai muovipussissa kaulimella. Sekoita joukkoon kaakaojauhe ja voisula. Painele seos leivinpaperilla vuoratun irtopohjavuoan (⌀ 20 cm) pohjalle.\n# Ota tuorejuustot huoneenlämpöön. Vatkaa vispikerma vaahdoksi. Sekoita jokkoon tuorejuustot ja sokerit.\n# Laita liivatteet likoamaan kylmään veteen. Kuumenna viski kattilassa kiehuvaksi. Nosta levyltä ja sekoita joukkoon puristellut liivatteet sekä pikakahvijauhe. Anna seoksen jäähtyä hetki.\n# Lisää viski-kahviseos tuorejuustomassaan ohuena nauhana koko ajan vatkaten.\n# Kaada täyte pohjan päälle. Anna kakun hyytyä kelmulla peitettynä pari tuntia tai yön yli jääkaapissa.\n# Vatkaa vispikerma vaahdoksi. Pursota kuvioita kakun päälle.\n# Koristele kaakaojauheella ja kahvipavuilla.",
    "Ingredients": "Pirkka Elise kandisokerikeksejä\nPirkka kaakaojauhetta\nPirkka voita sulatettuna\nPirkka maustamatonta tuorejuustoa\nPirkka laktoositonta vispikermaa\nsokeria\nvaniljasokeria\nliivatetta\nirlantilaista viskiä\nPirkka pikakahvijauhetta\nPirkka laktoositonta vispikermaa\nPirkka kaakaojauhetta (tummaa)\nkahvipapuja"
  },
  {
    "Id": 10612,
    "Name": "Piparimokkapalat",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10612?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Sulata voi ja anna jäähtyä. Sekoita maito voisulan joukkoon.\n# Vatkaa munat ja sokeri kuohkeaksi vaahdoksi.\n# Yhdistä kuivat aineet keskenään ja siivilöi ne muna-sokerivaahtoon vuorotellen jäähtyneen rasvaseoksen kanssa. Lisää lopuksi murennetut piparkakut.\n# Levitä taikina leivinpaperin päälle uunipellille (38 cm x 32 cm). Paista 200-asteisessa uunissa 14-15 minuuttia. Älä siirrä kypsää pohjaa pois pelliltä.\n# Murenna piparkakut ja varaa strösselit valmiiksi koristelua varten.\n# Paloittele voi kattilaan ja sulata miedolla lämmöllä. Kun voi on sulanut, lisää kattilaan piparkakkumauste. Sekoita ja anna mausteiden lämmitä voissa hetken.\n# Pidä kattila liedellä ja siivilöi tomusokeri erissä voimakkaasti sekoittaen voin joukkoon. Lisää kahvia vähän kerrallaan, kunnes seos on levitettävän paksuhkoa ja kiiltävää.\n# Kaada kuorrute tasaisesti pohjan päälle ja levitä tarvittaessa veitsellä tai lusikalla. Ripottele heti strösselit päälle ja painele pinnalle piparkakkupalat. Jos kuorrute ehtii jämähtää kattilaan, lämmitä se uudelleen ja lisää tarvittaessa tilkka kahvia tai vettä.\n# Leikkaa piparimokkapalat neliöiksi.",
    "Ingredients": "Pirkka voita\nmaitoa\nPirkka kananmunaa\nsokeria\nvehnäjauhoja\nPirkka kaakaojauhetta (tummaa)\nleivinjauhetta\npiparkakkumaustetta\nPirkka ohutpiparkakkua murennettuna\nPirkka voita\npiparkakkumaustetta\ntomusokeria\nvahvaa kahvia keitettynä\nPirkka ohutpiparkakkua\nPirkka suklaanmakuista strösseliä"
  },
  {
    "Id": 10587,
    "Name": "Juustotarjotin",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10587?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Tee piimäjuusto. Kiehauta maito kattilassa. Sekoita munat, kermaviili, piimä kulhossa. Mausta halutessasi vaniljasokerilla. Lisää seos kuumaan maitoon rauhallisesti, sekoita vain hetki. Kiehauta ja kytke lämpö pois. Anna seoksen levätä kannen alla noin 30 minuuttia, kunnes juustomassa on erottunut.\n# Asettele harsoliina siivilään tai läviköön ja nosta kulhon päälle. Nostele juustomassa toisella siivilällä liinan päälle. Sekoita suola tasaisesti massaan. Annan juuston jäähtyä hetki. Kiepauta liinan liepeet nyytiksi niin, että juusto saa pallon muodon. Nosta juusto jääkaappiin valumaan vähintään 2 tunniksi.\n# Paahda vuohenjuusto. Laita juusto uunivuokaan ja sivele 1 rkl:lla hunajaa. Kypsennä 225-asteisessa uunissa 10 minuuttia, lisää pähkinät vuokaan puolivälissä. Nosta vuohenjuusto tarjolle. Laita paahdettuja pähkinöitä, karpaloita ja hunajaa päälle. Loput pähkinät ja karpalot voit laittaa kippoihin tarjolle.\n# Kokoa juustotarjottimelle myös muita haluamiasi tarjottavia, kuten siemennäkkäriä, crostineja, ilmakuivattua kinkkua, taateleita ja paloiteltuja hedelmiä.",
    "Ingredients": "Pirkka täysmaitoa\nkananmunaa\nkermaviiliä\nPirkka rasvatonta piimää\nvaniljasokeria)\nsuolaa\nPirkka Parhaat vuohenjuustoa\nPirkka pähkinäsekoitusta\nPirkka pehmeitä karpaloita (kuivattuja)\nhunajaa\nPirkka Parhaat siemennäkkileipää\nPirkka crostineja, valkosipuli-persilja\nHK Rypsiporsas Gourmet ilmakuivattua kinkkua\ntuoreita taateleita\nhedelmiä"
  },
  {
    "Id": 10586,
    "Name": "Kukkakaaliwingsit ja dipit",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10586?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/M4UUrAI-7LI",
    "Instructions": "# Paahdettua valkosipulidippiä varten leikkaa valkosipuleiden päihin ristiviillot. Kypsennä niitä 200-asteessa noin 30 minuttia. Valkosipuli muuttuu miedon aromikkaaksi kypsyessään\n# Purista hieman jäähtyneiden valkosipuleiden pehmeä sisus kulhoon. Sekoita joukkoon jogurtti.  Mausta suolalla ja pippurilla. Ripottele pinnalle hienonnettua minttua tai persiljaa.\n# Sekoita BBQ-kastike ja sriracha keskenään.\n# Kypsennä kukkakaaliwingsejä jäisenä uunissa 250 °C 10-12 minuuttia tai friteerauskeittimessä 185 °C:ssa 2-3 minuuttia pieni määrä kerrallaan.\n# Tarjoa kukkakaaliwingsit dippien kanssa. Koristele annokset versoilla ja kastikeraidoilla.",
    "Ingredients": "Apetit kukkakaaliwingsejä (pakaste)\nversoja\nPirkka turkkilaista jogurttia\nPirkka yksikyntistä valkosipulia\nsuolaa\nmustapippuria\ntuoretta minttua tai persiljaa\nPirkka BBQ-kastiketta\nPirkka srirachakastiketta"
  },
  {
    "Id": 10583,
    "Name": "Vihreät kuulat-kakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10583?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Vaahdota voi ja fariinisokeri sähkövatkaimella. Sekoita muna taikinaan. Lisää hyvin pestyn sitruunan kuori ja mehu. Lisää keskenään sekoitetut kuivat aineet, vatkaa vain vähän.\n# Pingota leivinpaperi irtopohjavuoan (halk. 24 cm) pohjan ja reunan väliin. Levitä taikina vuokaan.\n# Paista kakkua 175-asteisessa uunissa noin 20 minuuttia, keskiosa saa jäädä hieman pehmeäksi. Anna jäähtyä täysin.\n# Valmista kuorrutus vatkaamalla kaikki kuorrutteen ainekset keskenään sähkövatkaimella kuohkeaksi kreemiksi. Irrota kakku vuoasta tarjoilulautaselle ja levitä kuorrute kakulle.\n# Leikkaa vihreät kuulat puoliksi ja irrota palat toisistaan niin, että saat neljä lohkoa. Asettele vihreät kuulat kuorrutteen päälle kuvan mukaisella tavalla.\n# Kakku on parhaimmillaan huoneenlämpöisenä. Yli jäänyt kakku säilyy jääkaapissa muutaman päivän.",
    "Ingredients": "huoneenlämpöistä Pirkka Voita\nfariinisokeria\nkananmuna\nsitruunan kuori raastettuna\nsitruunan mehua\nvehnäjauhoja\nleivinjauhetta\nkanelia\nsuolaa\nhuoneenlämpöistä Pirkka Voita\ntomusokeria\nsitruunanmehua\nFazer vihreitä kuulia"
  },
  {
    "Id": 10577,
    "Name": "Vegaaninen porkkanalaatikko",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10577?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Kuori ja lohko porkkanat. Keitä porkkanat vähässä vedessä, kannen alla täysin pehmeiksi, 30-40 minuuttia. Valuta porkkanat ja säästä noin 1 dl keitinvettä. Soseuta porkkanat sauvasekoittimella samattiseksi, ohenna sopivalla määrällä keitinvettä.\n# Porkkanoiden kypsyessä mittaa puuroriisi ja vesi kattilaan. Keitä muutama minuutti, kunnes vesi on imeytynyt riisiin. Lisää kasvisrasvasekoite. Keitä välillä sekoitellen, kannen alla 30-40 minuuttia, kunnes puuro on valmista.\n# Yhdistä porkkanasose, riisipuuro ja mausteet. Tarkista maku.\n# Voitele uunivuoka 1 rkl:lla margariinia. Kaada porkkanaseos vuokaan. Ripottele korppujauhot päälle ja tee lusikalla aaltokuvio pintaan. Lisää loppu margariini nokareina päälle.\n# Kypsennä 175-asteisessa uunissa noin 1 tunti 15 minuuttia, kunnes pinta on kullanruskea.",
    "Ingredients": "Pirkka porkkanoita\nPirkka puuroriisiä\nvettä\nPirkka kaura kasvirasvasekoitetta (16 %)\nsiirappia\nsuolaa\nmuskottipähkinää\nvalkopippuria\nPirkka leivontamargariinia\nkorppujauhoa"
  },
  {
    "Id": 10576,
    "Name": "Porkkanalaatikko ilman riisiä",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10576?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Kuori ja lohko porkkanat. Keitä porkkanat vähässä vedessä, kannen alla täysin pehmeiksi, 30-40 minuuttia. Valuta porkkanat ja anna jäähtyä haaleiksi.\n# Lisää kerma porkkanoiden joukkoon ja soseuta sauvasekoittimella samattiseksi. Lisää munat ja mausteet soseeseen. Tarkista maku.\n# Voitele uunivuoka 1 rkl:lla voita. Kaada sose vuokaan. Ripottele mantelijauhe päälle ja tee lusikalla aaltokuvio pintaan. Lisää loppu voi nokareina vuokaan.\n# Kypsennä laatikkoa 175-asteisessa uunissa noin 1,5 tuntia, kunnes pinta on kauniin ruskistunut.",
    "Ingredients": "Pirkka porkkanoita\nPirkka kuohukermaa\nkananmunaa\nsiirappia\nsuolaa\nmuskottipähkinää\njauhettua kardemummaa\nPirkka voita\nPirkka mantelijauhetta"
  },
  {
    "Id": 10575,
    "Name": "Jauhelihapasteijat",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10575?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Sekoita rahka ja voi kulhossa. Lisää jauhot, leivinjauhe ja suola. Sekoita nopeasti tasaiseksi, niin sitkoa ei ehdi muodostua. Muotoile taikina suorakaiteeksi ja kääri tuorekelmuun. Laita taikina kovettumaan vähintään 2 tunniksi jääkaappiin tai pakastimeen noin tunniksi.\n# Keitä riisi kypsäksi. Hienonna sipuli ja valkosipuli.\n# Kuumenna öljy paistinpannussa. Ruskista jauheliha. Lisää sipuli ja valkosipuli ja kypsennä muutama minuutti, kunnes sipuli on pehmennyt. Sekoita mausteet joukkoon.\n# Yhdistä riisi ja jauheliha. Anna jäähtyä haaleaksi. Lisää sitten raaka muna joukkoon. Se sitoo täytteen ja pasteijoiden täyttäminen on helpompaa.\n# Kauli kylmä taikina muutaman millin paksuiseksi suorakaiteen malliseksi levyksi. Voit myös jakaa taikinan kahtia, laita toinen puoli jääkaappiin odottamaan. Leikkaa levy neliön muotoisiksi (10 cm  x 10 cm) paloiksi. Jaa täyte paloille. Sivele reunat vedellä ja taita kolmion muotoon. \"Liimaa\" reunat haarukalla painellen.\n# Nosta pasteijat uunipellille leivinpaperin päälle. Voitele pinta munalla ja pistele haarukalla.\n# Paista pasteijat 225-asteisessa uunissa 12-15 minuuttia, kunnes ne ovat kullanruskeita ja kypsiä.",
    "Ingredients": "Pirkka laktoositonta maitorahkaa\nhuoneenlämpöistä Pirkka Voita\nvehnäjauhoja\nleivinjauhetta\nsuolaa\npitkäjyväistä riisiä\nsipuli\nvalkosipulinkynttä\nrypsiöljyä\njauhelihaa\npaprikajauhetta\nsuolaa\nmustapippuria\nkananmuna\nkananmuna"
  },
  {
    "Id": 10569,
    "Name": "Helppo fudge",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10569?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Vuoraa suorakaiteen muotoinen vuoka (25 x 25 cm) leivinpaperilla.\n# Paloittele suklaa paksupohjaiseen kattilaan. Kaada joukkoon maitotiiviste ja anna suklaan sulaa miedolla lämmöllä samalla sekoittaen. Mausta suolalla.\n# Kaada massa vuokaan. Koristele irtokarkeilla ja/tai piparminttutangoilla ja strösseleillä.\n# Anna fudgen jähmettyä jääkaapissa pari tuntia tai yön yli. Leikkaa paloiksi ja säilytä jääkaapissa hyvin peitettynä.",
    "Ingredients": "Pirkka valkoista leivontasuklaata\nkondensoitua maitoa (makeutettu maitotiiviste)\nsuolaa\nirtokarkkeja\nströsseleitä"
  },
  {
    "Id": 10568,
    "Name": "Nakki-perunasalaatti",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10568?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Huuhtele perunat ja leikkaa ne puoliksi tai lohkoiksi leivinpaperin päälle uunipellille. Lisää 2 rkl öljyä ja 2 tl grillimaustetta päälle, kääntele sekaisin. Kypsennä 225-asteisessa uunissa noin 25 minuuttia.\n# Paloittele nakit. Kuumenna 1 rkl öljyä paistinpannussa ja ruskista nakit. Siirrä hetkeksi lautaselle odottamaan. Lisää pavut ja 1/2 dl vettä pannuun ja hauduta noin 5 minuuttia, kunnes vesi on haihtunut. Mausta 1 tl:lla grillausmaustetta. Lisää nakit joukkoon ja nosta pannu liedeltä.\n# Yhdistä kastikkeen ainekset.\n# Sekoita nakit ja pavut kypsien perunoiden joukkoon pellillä tai tarjoilukulhossa. Hienonna kevätsipuli päälle. Tarjoa salaatti kuumana kastikkeen kanssa.",
    "Ingredients": "Pirkka pestyjä yleisperunoita\nrypsiöljyä\ngrillimaustetta\nPirkka lihaisia herkkunakkeja\nPirkka ohuita vihreitä papuja (pakaste)\nkevätsipulia\npiimää\nmajoneesia\nMaille Dijon kokojyväsinappia"
  },
  {
    "Id": 10556,
    "Name": "Helppo joulun täytekakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10556?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Irrota mutakakut vuoista jäisinä. Nosta toinen kakku valmiiksi tarjoiluvadille ja toinen leikkuulaudalle.\n# Vatkaa kerma vaahdoksi. Sekoita joukkoon rahka sekä luumumarmeladi.\n# Levitä mutakakun päälle puolet täytteestä. Liu'uta varovasti toinen mutakakku leikkuulaudalta täytteen päälle kanneksi ja levitä päälle loppu täyte. Koristele kakku esimerkiksi viinirypäleillä, granaattiomenan siemenillä ja suklaarouheella. Tarjoa kakku heti.",
    "Ingredients": "Pirkka mud cakea (pakaste)\nPirkka kuohukermaa\nPirkka laktoositonta maitorahkaa\nluumumarmeladia\ntummia siemenettömiä viinirypäleitä\ngranaattiomenan siemeniä\nsuklaata"
  },
  {
    "Id": 10554,
    "Name": "Marenkilumiukot",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10554?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Lisää kulhoon marenkijauhe ja vesi. Vatkaa sähkövatkaimella aluksi pienellä teholla ja sitten voimakkaasti vatkaten noin kolmen minuutin ajan. Siirrä marenkimassa pursotinpussiin.\n# Pursota marenkilumiukkoja leivinpaperin päälle uunipellille.\n# Paista 125-asteisessa uunissa noin tunnin verran.\n# Viimeistele marenkilumiukot piirtämällä silmät sekä nappirivi mustalla geelivärillä siveltimen tai cocktailtikun kärjellä.",
    "Ingredients": "Dr. Oetker marenkijauhetta\nvettä\nDr. Oetker mustaa geeliväriä"
  },
  {
    "Id": 10553,
    "Name": "Piparijuustokakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10553?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Vuoraa pieni irtopohjakakkuvuoka (Ø 20 cm) leivinpaperilla. Murskaa piparkakut. Sulata voi ja sekoita sula rasva keksimurskan joukkoon. Painele seos leivinpaperilla vuoratun irtopohjavuoan pohjalle tasaiseksi kerrokseksi. Nosta vuoka jääkaappiin.\n# Laita liivatteet kylmään veteen likoamaan. Vaahdota kerma.\n# Kuumenna 1/2 rkl vettä kiehuvaksi mikrossa tai pienessä kattilassa. Sekoita joukkoon hyvin puristellut liivatelehdet. Lisää seos ohuena nauhana rahkojen joukkoon samalla sekoittaen. Sekoita lopuksi joukkoon kermavaahto sekä käsin murskatut piparkakut.\n# Kaada täyte kakkuvuokaan ja painele pintaan halutessasi jo tässä vaiheessa muutama puolikas piparkakku. Anna kakun hyytyä jääkaapissa 4 tuntia tai yön yli.\n# Nosta kinuskipurkin toinen reuna auki ja leikkaa kulmaan saksilla pienen pieni reikä. Valuta kinuskia kakun pinnalle ja koristele piparkakuilla.",
    "Ingredients": "Pirkka piparkakkuja\nvoita\nliivatelehteä\nvettä\nPirkka piparkakkuja murskattuna\nArla Luomu kuohukermaa\nArla Ihana piparkakkurahkaa\nPirkka piparkakkuja\nPirkka kinuskikastiketta (tetra)"
  },
  {
    "Id": 10552,
    "Name": "Helppo kanakorma",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10552?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Poista kanapadasta muovikalvo. Sekoita kookosmaito lusikalla tasaiseksi ennen puolittamista. Sekoita kookosmaito ja maissitärkkelysjauhot keskenään. Kaada seos kanapadan päälle. Paista 175-asteisessa uunissa noin 1 tunti.\n# Nosta kanapalat pois uunivuoasta. Soseuta liemi sauvasekoittimella tasaiseksi. Lisää kanapalat takaisin vuokaan.\n# Keitä riisisekoitus pakkauksen ohjeen mukaan. Sekoita riisin joukkoon suola ja korianteri. Viipaloi chili.\n# Ripottele chiliviipaleet ja mantelilastut kanakorman päälle. Tarjoa kanapata korianteririisin kanssa.",
    "Ingredients": "Kariniemen kananpojan uunivalmis kanakorma kanapataa\nPirkka kookosmaitoa\nmaissitärkkelysjauhoja (Maizena)\nPirkka itämaista riisisekoitusta\nsuolaa\nkorianteria hienonnettuna\nPirkka mieto punainen chili\nPirkka mantelilastuja"
  },
  {
    "Id": 10551,
    "Name": "Gyūdon eli japanilainen lihakulho",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10551?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Ota liha huoneenlämpöön noin 30 minuuttia ennen valmistamista. Sekoita soijakastike, etikka, inkivääri ja sokeri keskenään. Kuori ja suikaloi sipuli.\n# Paista sipulit pannulla öljyssä. Lisää lihasuikaleet ja kastike. Hauduta pari minuuttia, kunnes liha ei ole enää punaista. Älä kypsennä liikaa, jotta liha pysyy mehevänä.\n# Paista kananmunat erikseen pannulla öljyssä.\n# Valmista riisi. Huuhdo riisiä siivilässä juoksevan kylmän veden alla, kunnes vesi on kirkasta. Kaada riisi kattilaan ja lisää kylmää vettä niin, että riisi peittyy. Anna seistä 20 minuuttia ja siivilöi vesi pois kattilasta.\n# Lisää 4 dl vettä ja kuumenna kiehuvaksi ilman kantta. Hauduta riisiä kannen alla miedolla lämmöllä 10 minuuttia, kunnes kaikki vesi on imeytynyt riisiin. Vältä kannen nostamista, äläkä sekoita riisiä keittämisen aikana.\n# Ota kattila pois liedeltä. Sekoita riisiviinietikka, sokeri ja suola keskenään. Mausta riisi etikkaseoksella.\n# Jaa riisi annoskulhoihin. Lisää päälle lihasuikaleet, paistettu kananmuna sekä kevätsipulia. Koristele murustetulla tai suikaloidulla merilevällä.",
    "Ingredients": "naudan paistisuikaleita, maustamaton\nPirkka japanilaista soijakastiketta\nPirkka riisiviinietikkaa\ntuoretta inkivääriä hienonnettuna\nsokeria\nsipuli\nöljyä\nkananmunaa\nkevätsipulia hienonnettuna\nsushi nori merilevää\nPirkka Parhaat sushiriisiä\nvettä\nPirkka riisiviinietikkaa\nsokeria\nsuolaa"
  },
  {
    "Id": 10550,
    "Name": "Kalacurry",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10550?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/sN14Iy3Tpf4",
    "Instructions": "# Sulata kalapalat pakkauksen ohjeen mukaan. Ripottele kalojen pintaan suolaa.\n# Kuutioi paprika ja kuorittu sipuli. Kuullota kasviksia öljyssä pannulla, kunnes ne hieman pehmenevät. Lisää currytahna ja kookosmaito. Kuumenna.\n# Paloittele sulaneet kalat reiluiksi annospaloiksi. Lisää kalat sekä pavut kuuman kastikkeen joukkoon. Hauduta muutama minuutti, kunnes kala on kypsää.\n# Mausta curry kalakastikkeella, limetinmehulla ja sokerilla. Maista, ja lisää mausteita tarvittaessa. Tarjoa kalacurry jasmiiniriisin kanssa.",
    "Ingredients": "Pirkka alaskanseitifileepaloja (pakaste)\nsuolaa\nkeltaista paprikaa\nsipulia\nöljyä\nPirkka punaista currytahnaa\nPirkka kookosmaitoa\nPirkka ohuita vihreitä papuja (pakaste)\nPirkka kalakastiketta\nlimetinmehua\nsokeria"
  },
  {
    "Id": 10548,
    "Name": "Oreokakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10548?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Erottele kekseistä täyte ja keksit eri kulhoihin. Laita 1/3 kekseistä sivuun myöhempää käyttöä varten.\n# Hienonna keksit (2/3) monitoimikoneessa. Sekoita joukkoon sulatettu rasva. Painele seos leivinpaperilla vuoratun irtopohjavuoan (⌀ 20 cm) pohjalle.\n# Pane liivatelehti pehmenemään kylmään veteen noin 10 minuutiksi. Vatkaa 1 1/2 dl kermaa vaahdoksi.\n# Sekoita yksi purkillinen vaniljatuorejuustoa keksitäytteiden kanssa sähkövatkaimella sekoittaen. Sekoita joukkoon loput tuorejuustot.\n# Kiehauta loput kermat ja sokeri kattilassa ja nosta kattila pois liedeltä. Purista liivatelehti kuivaksi ja lisää kuumaan kermaan. Sekoita tasaiseksi. Lisää liivate-kermaseos vaniljatuorejuustotäytteen joukkoon huolellisesti sekoittaen. Lisää lopuksi kermavaahto ja sekoita tasaiseksi. Kaada seos vuokaan ja tasoita pinta.\n# Hienonna loput keksit (1/3) monitoimikoneessa hienoksi hiekaksi. Ripottele keksihiekka tasaisesti tuorejuustotäyteen päälle.\n# Nosta vuoka jääkaappiin hyytymään yön yli. Irrota kakku varovasti vuoasta ja koristele pinta minioreoilla.",
    "Ingredients": "Oreo-täytekeksejä\nvoita\nliivatelehti\nPirkka vispikermaa\nPirkka vaniljatuorejuustoa\nsokeria\nOreo Mini -keksejä"
  },
  {
    "Id": 10547,
    "Name": "Poropiirakka",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10547?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Sulata taikina ja taputtele se suorakaiteen muotoisen piirakkavuoan (36 × 10 cm) pohjalle ja reunoille. Piirakan voi tehdä myös pyöreään vuokaan (Ø 26 cm). Esipaista piirakkapohjaa 200-asteisen uunin alimmalla tasolla noin 10 minuuttia\n# Suikaloi halkaistu ja huuhdeltu purjon valkoinen osa. Kuullota purjo pehmeäksi öljyssä. Sekoita kulhossa ranskankerma, kananmunat, parmesan, suola, pippuri ja persilja. Suikaloi poron kylmäsavupaisti.\n# Levitä puolet ranskankermaseoksesta piirakan pohjalle. Lisää 2/3 purjoista sekä kylmäsavupaisti. Lisää loput purjot sekä ranskankermaseos.\n# Paista uunin alatasolla noin 30 minuuttia. Koristele jäähtynyt piirakka hienonnetulla persiljalla.",
    "Ingredients": "Pirkka rukiista piirakkataikinaa (pakaste)\nPirkka Parhaat poron kylmäsavupaistia\npurjo\nPirkka crème fraîchea (ranskankermaa, 18 %)\nkananmunaa\nPirkka Parhaat parmesaania raastettuna\nsuolaa\nmustapippuria\nhienonnettua persiljaa\nhienonnettua persiljaa"
  },
  {
    "Id": 10546,
    "Name": "Tomusokerilla koristeltu piparkakkutalo",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10546?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Leikkaa piparkakkutalon kaavat esimerkiksi pahvista. Sulata piparkakkutaikina ohjeen mukaan.\n# Ota toisesta piparkakkutaikinasta 2/3 ja kauli jauhotetulla työtasolla taikinasta 3-4 mm:n paksuinen soikea levy, jonka päälle piparkakkutalo rakennetaan.\n# Kauli lopusta (1/3) taikinasta 3-4 mm:n paksuinen levy ja leikkaa taikinasta mökin toinen pääty sekä toinen sivuseinä terävällä veitsellä. Varo kaulimasta piparitalon osia liian ohueksi.  Nosta palaset varovasti pellille leivinpaperin päälle esimerkiksi lastan avulla.\n# Ota jäljelle jääneestä piparitaikinasta 2/3 ja kauli siitä taikinasta 3-4 mm:n paksuinen levy ja leikkaa levystä terävällä veitsellä mökin kattopalaset sekä savupiipun osat.\n# Kauli jäljelle jääneestä taikinasta (1/3) myös 3-4 mm:n paksuinen levy ja leikkaa siitä piparitalon toinen pääty sekä toinen sivuseinä. Jäljelle jääneestä taikinasta voit paistaa kuusia piparkakkutalon pihalle sekä muita herkuttelupipareita. Nosta palaset varovasti pellille leivinpaperin päälle. Voit vielä tarvittaessa muotoilla ja suoristaa piparkakkutalon osia.\n# Koristele piparkakkutalon osat. Kaiverra haluamiasi kuvioita taikinaan, kuitenkin niin, että kaiverrus ei mene kokonaan taikinan läpi. Leikkaa halutessasi toiseen päätypalaan oviaukko ja koristele se.\n# Paista osia 175-asteessa 8-10 minuuttia uunin keskitasolla. Isommat palaset paistuvat kauemmin, kuin pienet. Siirrä paistuneet osat leivinpapereineen tasaiselle alustalle jäähtymään.\n# Kokoa piparkakkutalo vasta seuraavana päivänä, jotta piparitalon osat ovat kunnolla jäähtyneet ja kovettuneet. Säilytä osat kuivassa ja viileässä.\n# Hiero tomusokeri piparitalon osien pinnalle. Kokoa piparkakkutalo leivontaliiman avulla.",
    "Ingredients": "piparkakkutaikinaa (pakaste)\nDr. Oetker Leivontaliimaa\ntomusokeria"
  },
  {
    "Id": 10543,
    "Name": "Kahvikakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10543?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/WVU47Vn40_I",
    "Instructions": "# Liuota pikakahvi sekä vaniljasokeri kuumaan veteen ja sekoita hyvin.\n# Laita uuni kuumenemaan 175 asteeseen. Voitele ja korppujauhota kakkuvuoka (tilavuus 1,8 l).\n# Vaahdota pehmeä rasva ja sokeri. Lisää vaahtoon huoneenlämpöiset munat yksitellen hyvin vatkaten.\n# Sekoita vehnäjauhoihin leivinjauhe ja siivilöi mukaan kaakaojauhe ja sekoita. Lisää jauhoseos taikinaan vuorotellen kahvin kanssa ja sekoita tasaiseksi.\n# Kaada taikina vuokaan ja paista kakkua 175-asteisen uunin alimmalla tasolla 45-55 minuuttia. Varmista kakun kypsyys tikulla. Kumoa kakku hieman jäähtyneenä.\n# Kiehauta vesi, lisää joukkoon pikakahvi ja sekoita hyvin. Lisää joukkoon voi ja sekoita, kunnes voi on sulanut kahvin joukkoon. Lisää kaakao ja sekoita. Lisää tomusokeri parissa erässä ja sekoita kuorrutus tasaiseksi. Kuorrute saa olla melko paksua.\n# Valuta kuorrutusta kakun päälle lusikalla ja ripottele pinnalle strösseleitä. Anna kuorrutuksen jähmettyä ennen tarjoamista.",
    "Ingredients": "Nescafe Kulta -pikakahvia\nPirkka vaniljasokeria\nvettä\nhuoneenlämpöistä Pirkka Voita\nsokeria\nkananmunaa\nvehnäjauhoja\nleivinjauhetta\nPirkka kaakaojauhetta\nkiehuvaa vettä\nNescafe Kulta -pikakahvia\nvoita\nkaakaojauhetta\ntomusokeria\nPirkka suklaanmakuisia strösseleitä"
  },
  {
    "Id": 10542,
    "Name": "Luumupavlova",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10542?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Erottele keltuaiset ja valkuaiset. Riko valkuaisten rakenne kulhossa. Lisää sokeri valkuaisten joukkoon vähitellen, koko ajan voimakkaasti sätkövatkaimella vatkaten. Vatkaa seosta, kunnes se on kiiltävän valkoista, paksua ja jähmeää. Lisää lopuksi etikka ja perunajauhot ja vatkaa vielä pari minuuttia.\n# Vuoraa uunipelti leivinpaperilla. Levitä marenkivaahto kahden ympyrän (⌀ noin 20 cm) muotoon leivinpaperin päälle. Tee reunoista hieman keskustaa paksummat.\n# Kuivata marenkia 100-asteisessa uunissa 2 tuntia. Marengin tulee olla pinnalta kuiva, mutta sisältä pehmeä kuin vaahtokarkki. Anna marengin jäähtyä.\n# Vatkaa kerma vaahdoksi. Sekoita joukkoon luumu-kanelirahka.\n# Levitä puolet luumurahka-kermaseoksesta marengille. Valuta pinnalle suklaakastiketta raitoina.\n# Nosta toinen marenkilevy edellisen pinnalle ja levitä sille loppu luumurahkaseos. Koristele pavlova erilaisilla pilkotuilla hedelmillä sekä rosmariinin oksilla. Ripottele pinnalle lopuksi kuorittuja ja rouhittuja pistaasipähkinöitä.",
    "Ingredients": "Pirkka Parhaat ulkokanojen munaa\nsokeria\nväkiviinaetikkaa\nperunajauhoja\nPirkka vispikermaa\nValio maustettua rahkaa, luumu-kaneli\nPirkka suklaakastiketta, tuubi\ntuoretta viikunaa\ngranaattiomenan siemenet\nluumua\nPirkka persimoni\nkumkvattia\nPirkka paahdettuja ja suolattuja pistaasipähkinöitä rouhittuna\ntuoretta rosmariinia"
  },
  {
    "Id": 10541,
    "Name": "Harissasilakat",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10541?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Huuhdo silakat nopeasti juoksevan kylmän veden alla ja kuivaa ne talouspaperilla.\n# Siirrä silakat kulhoon ja mausta suolalla. Sekoita joukkoon 1 rkl harissatahnaa.\n# Mittaa pieneen kulhoon korppujauhot ja lisää loput harissatahnasta (3 rkl) sekä oliiviöljy. Sekoita ainekset haarukalla keskenään murumaiseksi seokseksi.\n# Voitele uunivuoka ja asettele siihen silakat riviin. Ripottele päälle harissamuru.\n# Paista 225-asteisen uunin ylätasolla noin 8 minuuttia, kunnes kalat ovat kypsiä. Ripottele pinnalle hienonnettua persiljaa. Tarjoa harissasilakat alkupalaksi tapasten tapaan.",
    "Ingredients": "puhkottuja silakoita\nitsetehtyä harissatahnaa\nsuolaa\nkorppujauhoja\nPirkka Luomu ekstra-neitsytoliiviöljyä\n(lehti)persiljaa hienonnettuna"
  },
  {
    "Id": 10540,
    "Name": "Teriyaki-jauhelihanuudelit",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10540?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Valmista nuudelit pakkauksen ohjeen mukaan. Valuta ja lisää joukkoon seesamiöljy. Pidä lämpiminä.\n# Ruskista jauheliha rypsiöljyssä. Lisää lopuksi teriyakikastike ja kuumenna. Tarkista maku ja lisää tarpeen mukaan mustapippuria, soijakastiketta tai mustapippuria.\n# Kuori porkkanat ja leikkaa ne pitkiksi ohuiksi suikaleiksi julienne-raastimella. Leikkaa kurkusta samanlaisia pitkiä soiroja kuin porkkanasta. Suikaloi kevätsipuli.\n# Kokoa annos kulhoon nuudeleista ja jauhelihasta. Voit myös halutessasi pyöräyttää nuudelit sekaisin jauhelihan kanssa pannulla, jolloin ne kuumenevat samalla. Laita annoksen pinnalle porkkanaa, kurkkua ja viimeistele kevätsipulilla.",
    "Ingredients": "Pirkka munanuudeleita\nseesamiöljyä\nrypsiöljyä\nsika-nautajauhelihaa\nPirkka teriyakikastiketta\n(soijakastiketta)\nporkkanaa\nkurkku\nkevätsipulin vartta\nmustapippuria"
  },
  {
    "Id": 10538,
    "Name": "Nopea kanacouscous",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10538?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/fmtiGUSovOo",
    "Instructions": "# Kuumenna broilerinpalat kasarissa öljyssä. Lisää taatelit, pavut, couscous, vesi ja mausteet.\n# Keitä kannen alla 3 minuuttia. Nosta kasari sitten liedeltä ja anna tekeytyä 5 minuuttia.\n# Sekoita couscous ilmavaksi. Ripottele vielä sumakkia koristeeksi.\n# Tee appelsiinijogurtti. Raasta hyvin pestyn appelsiinin kuori kulhoon. Sekoita jogurtti ja hunaja joukkoon.\n# Leikkaa appelsiini kuorettomiksi lohkoiksi couscousin päälle. Tarjoa couscous appelsiinijogurtin kanssa.",
    "Ingredients": "Kariniemen kananpojan paistettuja broilerin fileepaloja\noliiviöljyä\nPirkka pehmeitä taateleita\nPirkka ohuita vihreitä papuja (pakaste)\ncouscousia\nvettä\nsumakkia\nkanelia\nkurkumaa\nsuolaa\nappelsiini\nPirkka turkkilaista jogurttia\njuoksevaa hunajaa"
  },
  {
    "Id": 10537,
    "Name": "Vaniljariisipuuro ja kirsikkahilloke",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10537?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Sekoita kiehuvaan veteen riisi ja suola. Halkaise vaniljatanko ja kaavi siemenet lusikalla ja lisää siemenet sekä tanko kattilaan. Keitä noin 25 minuuttia välillä sekoittaen. Lisää Fraîche -kerma ja sokeri. Anna puuron hautua hiljalleen noin 10 minuuttia, sekoita välillä.  Poista lopuksi halkaistu vaniljatanko.\n# Pane kaikki hillokkeen ainekset kattilaan ja keitä voimakkaasti kiehuen noin 25 minuuttia niin, että neste haihtuu. Sekoita välillä. Jäähdytä kylmässä vesihauteessa ja tarjoa hilloke riisipuuron kanssa.",
    "Ingredients": "vettä\nPirkka puuroriisiä\nsuolaa\nvaniljatanko\nArla Lempi Fraîche -kermaa\nsokeria\nPirkka Parhaat kirsikoita (pakaste)\nPirkka Parhaat luomuglögiä\nsokeria\nPirkka vaniljasokeria"
  },
  {
    "Id": 10536,
    "Name": "Helppo lasten jäätelökakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10536?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Vuoraa irtopohjavuoka (halk. 20 cm) siististi tuorekelmulla.\n# Paloittele jäätelöt suureen kulhoon jääkaappiin pehmenemään hetkeksi.\n# Tee keksipohja. Jauha keksit tehosekoittimella tai survimella muruksi. Sekoita suklaakastike joukkoon. Painele seos vuoan pohjalle. Voit ripotella keksiseoksen päälle hieman jauhoja, niin se ei tartu sormiin.\n# Kääntele jäätelö suht sekaisin. Murusta marengit reiluiksi paloiksi jäätelön joukkoon ja sekoita.\n# Lusikoi jäätelö vuokaan, ripottele nonparellejä joukkoon ja tasoita pinta. Peitä kelmulla ja laita pakastimeen vähintään 3 tunniksi. Voit tehdä kakun jo tarjoamista edeltävä päivänä.\n# Kiinnitä paperista askarrellut hatut leluhahmojen päihin sinitarralla.\n# Irrota kakku vuoasta tarjoilulautaselle. Koristele hienolla marenkimurulla ja nonparelleilla. Nosta leluhahmot kakun päälle.",
    "Ingredients": "Pirkka vaniljakermajäätelöä\nvärikästä jäätelö (esim. mansikka tai päärynä)\nmarenkeja\nPirkka nonparelleja\nPirkka kolmen suklaan pehmeitä cookieita tai muita suklaakeksejä\nPirkka suklaakastiketta\nmarenkeja\nPirkka nonparelleja\nleluhahmoja (esim. viidakon eläimiä, Ryhmä Hau, Pipsa Possu, L.O.L. Surprise, Transformers, Legot)\npaperista askarreltuja hattuja\nsinitarraa"
  },
  {
    "Id": 10535,
    "Name": "Frozen-kakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10535?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Pingota leivinpaperi irtopohjavuoan (18-20 cm) pohjan ja reunan väliin. Voitele reunat.\n# Yhdistä maito, öljy ja sokeri isossa kulhossa kaapimella käännellen. Lisää kuivat aineet, leivinjauhe ja mausteet jauhoihin sekoitettuna. Kääntele jäiset mustikat joukkoon. Kaada taikina vuokaan.\n# Paista kakkua 175-asteisessa uunissa noin 1,5 tuntia tai kunnes se on tikulla kokeiltaessa kypsä. Laita leivinpaperi vuoan päälle, kun pinta alkaa tummua. Anna kakun jäähtyä.\n# Jos kakun pinta on kohonnut kovin pyöreäksi, leikkaa siitä korkein ”hattu” pois. Leikkaa kakku 3 kerrokseen.\n# Sulata täytteen mustikat ja soseuta sauvasekoittimella. Laita liivatteet pehmenemään reiluun määrään kylmää vettä.\n# Vaahdota kerma. Sekoita rahka, tomusokeri ja mustikkasose joukkoon. Kiehauta 2 rkl vettä. Purista liivatteista vesi ja sekoita kuumaan vesitilkkaan. Kaada liivatteet mustikkavaahtoon samalla sekoittaen.\n# Täytä kakku. Pesaise irtopohjavuoka ja vuoraa se pitkillä tuorekelmun paloilla. Laita alin kakkulevy vuokaan. Kostuta kevyesti kaurajuomalla. Levitä puolet täytteestä päälle. Nosta seuraava kakkulevy päälle ja kostuta se. Ota toisen samankokoisen irtopohjavuoan reunaosa ja laita se toisen vuoan jatkoksi, niin saat koottua korkean kakun. Lisää loppu täyte ja viimeinen kakkulevy, kostuta. Laita kakku jääkaappiin vähintään 4 tunniksi, mielellään yöksi.\n# Tee kuorrute. Vaahdota pehmeä voi, tomusokeri ja maito sähkövatkaimella kuohkeaksi. Vatkaa tuorejuusto joukkoon.\n# Irrota kakku vuoasta tarjoiluvadille. Levitä kuorrute kakulle.\n# Koristele kakun alaosa nonparelleilla. Nosto kakku jääkaappiin tarjoamiseen asti. Se säilyy koristeltuna hyvin seuraavaan päivään.\n# Viimeistele kakku. Laita muutama marenki kakun päälle ja murusta loput ”lumeksi”. Koristele toffeepalloilla. Laita keppiviiri ja muu rekvisiitta kakun päälle. Voit suojata keppien alaosan tuorekelmulla.",
    "Ingredients": "Pirkka kaurajuomaa\nrypsiöljyä\nsokeria\nvehnäjauhoja\nvaniljasokeria\nleivinjauhetta\nkardemummaa\nsuolaa\nPirkka suomalaisia mustikoita (pakaste)\nPirkka suomalaisia mustikoita (pakaste)\nliivatelehteä\nPirkka laktoositonta vispikermaa\nPirkka laktoositonta maitorahkaa\ntomusokeria\nvettä\nPirkka kaurajuomaa\nhuoneenlämpöistä voita\ntomusokeria\nPirkka kaurajuomaa\nPirkka maustamatonta tuorejuustoa\nDr. Oetker Ocean Mix koristerakeita\nmarenkia\ntoffeelumipalloja\nmuuta rekvisiittaa (Elsa ja Olaf, oksat ja paperiviiri)"
  },
  {
    "Id": 10534,
    "Name": "Kananachopelti",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10534?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Kuumenna öljy paistinpannussa. Paista broilerisuikaleita muutama minuutti. Huuhtele kikherneet ja lisää pannuun. Jatka paistamista muutama minuutti.\n# Levitä maissilastut leivinpaperin päälle uunipellille. Lisää broilerit ja kikherneet. Raasta juusto ja ripottele se pinnalle.\n# Kypsennä nachopeltiä 225-asteisessa uunissa noin 10 minuuttia, kunnes juusto on sulanut.\n# Kuutioi tomaatti ja kurkku. Leikkaa salaatti lohkoiksi. Hienonna korianteri. Valuta jalapenot. Laita ranskankerma ja salsa kuppeihin tarjolle.\n# Nostele kasvikset kuuman nachopellin päälle. Tarjoa dippien kanssa.",
    "Ingredients": "Kariniemen kananpojan fajitassuikaleita\nrypsiöljyä\nPirkka kikherneitä suolaliemessä\nPirkka tortillachipsejä\nPirkka Parhaat cheddaria\ntomaattia\nkurkkua\njäävuorisalaattia\nkorianteria\nPirkka vihreitä jalapenoviipaleita\nPirkka crème fraîchea (ranskankermaa, 18 %)\nPirkka meksikolaista salsa chilpotle -kastiketta"
  },
  {
    "Id": 10533,
    "Name": "Japanilainen katkarapukulho",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10533?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Mittaa riisi siivilään. Huuhdo juoksevan kylmän veden alla, kunnes vesi on kirkasta. Kaada riisi kattilaan ja lisää kylmää vettä niin, että riisi peittyy. Anna seistä 20 minuuttia ja siivilöi vesi pois kattilasta.\n# Lisää 3,5 dl vettä ja kuumenna kiehuvaksi. Hauduta riisiä kannen alla miedolla lämmöllä 10 minuuttia, kunnes kaikki vesi on imeytynyt riisiin. Vältä kannen nostamista äläkä sekoita riisiä keittämisen aikana.\n# Ota kattila pois liedeltä ja anna vetäytyä 10 minuuttia. Pirskota riisiviinietikka riisin päälle ja kääntele riisi varovasti ilmavaksi.\n# Riisin kypsentämisen lomassa keitä soijapapuja 3-4 minuuttia. Valuta pavut.\n# Yhdistä kastikkeen ainekset, korianteri varsineen. Halkaise ja viipaloi avokadot.\n# Kokoa annokset: jaa riisi kulhoihin, nostele papuja, avokadoa, katkarapuja ja inkivääriä päälle. Laita runsaasti korianteria koristeeksi. Tarjoa kulhot kastikkeen kanssa.",
    "Ingredients": "Pirkka Parhaat sushiriisiä\nvettä\nPirkka riisiviinietikkaa\nsokeria\nsuolaa\nPirkka Parhaat chili-seesamikatkarapuja\nPirkka soijapapuja (pakaste)\navokadoa\nPirkka sushi inkiväärilastuja\nkorianteria\nPirkka japanilaista soijakastiketta\nPirkka riisiviinietikkaa\nlimetin mehu\nPirkka mieto punainen chili hienonnettuna\nkorianteria hienonnettuna"
  },
  {
    "Id": 10532,
    "Name": "Alkoholiton gin tonic",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10532?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Tee ginisiirappi. Mittaa sokeri ja vesi kattilaan. Murskaa katajanmarjoja morttelissa tai survimella ja laita kattilaan. Vuole pestyn appelsiinin kuori joukkoon, voit jättää pari suikaletta koristeeksi. Keitä seosta hiljaa poristen pari minuuttia, kunnes sokeri on sulanut. Anna siirapin maustua huoneenlämmössä vähintään 4 tuntia, mielellään yön yli. Siivilöi siirappi.\n# Täytä lasit jäillä. Lisää 2 cl ginisiirappia ja kaada limonadi päälle. Sekoita pitkävartisella lusikalla.\n# Koristele lasit appelsiininkuorisuikaleella ja halutessasi vaahtokarkilla. Pujota vaahtokarkki cocktailtikkuun. Paahda kaasupolttimolla tai kaasulieden liekissä.",
    "Ingredients": "Fentimans (Pink Grapefruit) tonicia\njäitä\nsokeria\nvettä\nkatajanmarjoja\nappelsiinin kuori\nappelsiininkuorta\nvaahtokarkkia"
  },
  {
    "Id": 10530,
    "Name": "Kissakakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10530?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Pingota leivinpaperi irtopohjavuoan (18 cm) pohjan ja reunan väliin. Voitele reunat.\n# Kuori ja raasta bataatti raastimen hienolla terällä. Yhdistä raaste, maito, öljy ja sokeri isossa kulhossa kaapimella käännellen. Lisää kuivat aineet, leivinjauhe ja mausteet jauhoihin sekoitettuna. Kaada taikina vuokaan.\n# Paista kakkua 175-asteisessa uunissa noin 1,5 tuntia, kunnes kakku on tikulla kokeiltaessa kypsä. Anna jäähtyä.\n# Muusaa banaanit haarukalla. Sekoita loput täytteen ainekset toisessa kulhossa.\n# Jos kakun pinta on kohonnut kovin pyöreäksi, leikkaa siitä korkein ”hattu” pois. Leikkaa kakku neljään kerrokseen. Levitä banaanisosetta ja tuorejuustotäytettä kakkukerrosten väliin.\n# Vaahdota pehmeä voi, tomusokeri ja maito sähkövatkaimella kuohkeaksi. Vatkaa tuorejuusto joukkoon. Värjää kuorrute geelivärillä haluamasi sävyiseksi harmaaksi. Levitä kuorrute kakulle tasaisesti. Nosto kakku jääkaappiin odottamaan.\n# Tee koristeet. Kauli Kick-patukoista korvat ja nenä ja leikkaa ne veitsellä sopivan muotoisiksi. Muotoile yli jääneistä paloista silmät. Painele kultaisia koristerakeita korvien ja nenän pintaan. Laita korvat jääkaappiin jähmettymään. Nenän ja silmät voit jo painaa kakun pintaan.\n# Rapsuta suolatikkujen pinnasta suolarakeet pois. Päällystä tikut kimallesuihkeella.\n# Laita korvat ja viikset kakun koristeeksi juuri ennen tarjoamista.",
    "Ingredients": "pieni bataatti\nmaitoa\nrypsiöljyä\nsokeria\nvehnäjauhoja\nleivinjauhetta\nkardemummaa\nkanelia\nsuolaa\nbanaania\nPirkka vaniljatuorejuustoa\nPirkka laktoositonta maitorahkaa\ntomusokeria\nhuoneenlämpöistä Pirkka Voita\ntomusokeria\nmaitoa\nPirkka vaniljatuorejuustoa\nDr. Oetker mustaa geeliväriä\nKick Original lakritsitoffeeta\nDr. Oetker black & gold -koristerakeita\nPirkka suolatikkua\nDr. Oetker kimallesuihketta, kulta"
  },
  {
    "Id": 10529,
    "Name": "Omenapannukakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10529?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Vaahdota munat ja sokeri sähkövatkaimella kuohkeaksi. Vatkaa maito, jogurtti ja öljy joukkoon. Yhdistä kuivat aineet ja sekoita taikinaan.\n# Poista omenoista siemenkodat. Viipaloi omenat vajaan puolen sentin paksuisiksi renkaiksi.\n# Kaada taikina korkeareunaiselle uunipellille leivinpaperin päälle. Asettele omenat pinnalle. Ripottele sokeri päälle.\n# Paista 200-asteesen uunin alatasossa noin 20 minuuttia, kunnes pannari on kypsä ja ruskistunut.\n# Tarjoa pannari vaikka turkkilaisen jogurtin ja hunajan kanssa.",
    "Ingredients": "kananmunaa\nsokeria\nmaitoa\nPirkka turkkilaista jogurttia\nrypsiöljyä\nvehnäjauhoja\nvaniljasokeria\nkardemummaa\nleivinjauhetta\nsuolaa\nhapanta omenaa (kotimaista tai Jonagold)\nfariinisokeria tai muuta ruskeaa sokeria"
  },
  {
    "Id": 10527,
    "Name": "Srirachamukikakut",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10527?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Yhdistä kuivat aineet kulhossa. Sekoita maito, öljy ja muna joukkoon. Mausta maun mukaan srirachalla.\n# Jaa taikina neljään mikron kestävään kuppiin. Upota jokaiseen kuppiin 2 suklaapalaa.\n# Kypsennä yksi mukikakku testiksi mikron täydellä teholla, 30-50 sekuntia. Ota kakku on mikrosta heti, kun kakun pinta kohoaa muhkeaksi kupin yläosaan. Kakku saa jäädä hyvin taikinaiseksi. Kypsennä loput kakut yksi kerrallaan.\n# Tarjoa mukikakut lämpiminä vaniljajäätelön kanssa.",
    "Ingredients": "vehnäjauhoja\nsokeria\nPirkka kaakaojauhetta (tummaa)\nleivinjauhetta\nmaitoa\nrypsiöljyä\nkananmuna\nPirkka srirachakastiketta\nPirkka tummaa leivontasuklaata (55 %)\nPirkka vaniljakermajäätelöä"
  },
  {
    "Id": 10526,
    "Name": "Serranonkinkkusipsit",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10526?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Leikkaa kinkkuviipaleet 3 palaan. Levitä palat uunipellille leivinpaperin päälle. Paahda 200-asteisessa uunissa noin 10 minuuttia, kunnes palat ovat rapeita kuin sipsi. Anna jäähtyä.\n# Sipaise ricottaa kinkkusipsien päälle. Koristele granaattiomenansiemenillä ja lehtipersiljalla.",
    "Ingredients": "Pirkka Parhaat Jamón Serrano serranokinkkua\nPirkka Parhaat ricottaa\nPirkka granaattiomenansiemeniä (pakaste) tai 1 granaattiomena\nlehtipersiljaa"
  },
  {
    "Id": 10525,
    "Name": "Klementiinihillo",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10525?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Kuori sitrukset ja poista mahdolliset siemenet. Soseuta hedelmät tehosekoittimella sileäksi soseeksi. Kaada sose kattilaan.\n# Lisää loput ainekset. Keitä hilloa matalalla lämmöllä 5 minuuttia. Nostele pintaan nouseva vaalea vaahto kauhalla pois.\n# Laita kuuma hillo puhtaisiin lasipurkkeihin. Anna jäähtyä. Tarjoa hillo croissantien tai juustojen kanssa.",
    "Ingredients": "klementiinejä tai satsumia\nhillosokeria\nsitruunanmehua\nPirkka vaniljasokeria"
  },
  {
    "Id": 10524,
    "Name": "Pestolihapullat tomaattikastikkeessa",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10524?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/SIC3zAKA7G8",
    "Instructions": "# Sekoita tomaattikastikkeen ainekset uunivuoassa, kaprikset liemineen.\n# Sekoita lihapullien ainekset tasaiseksi massaksi. Muotoile massa pulliksi tomaattikastikkeen päälle.\n# Kypsennä lihapullia 225-asteisessa uunissa noin 20 minuuttia, kunnes pullat ovat kypsiä.\n# Tarjoa keitetyn spagetin ja raastetun parmesaanin kanssa.",
    "Ingredients": "Pirkka naudan jauhelihaa (17 %)\nPirkka punaista pestoa\nkananmuna\nsuolaa\nPirkka tomaattimurskaa\nPirkka punaista pestoa\nPirkka kapriksia\nPirkka Parhaat parmesaania raastettuna\nkuivattua oreganoa tai basilikaa\nmustapippuria\nPirkka spagettia\nPirkka Parhaat parmesaania"
  },
  {
    "Id": 10523,
    "Name": "Vihreä salaatti ja granaattiomenavinegretti",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10523?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Tee vinegretti. Halkaise granaattiomena ja irrota siemenet suureen kulhoon. Lisää myös irtoava mehu. Sekoita joukkoon öljy, etikka sokeri ja suola.\n# Lisää salaatti vinegretin joukkoon juuri ennen tarjoamista. Viipaloi päärynä kuorineen joukkoon ja kääntele sekaisin.",
    "Ingredients": "Pirkka Provence salaattisekoitusta\npäärynä\ngranaattiomenan siemenet\nPirkka ekstra-neitsytoliiviöljyä\nvalkoviinietikkaa\nsokeria\nsuolaa"
  },
  {
    "Id": 10522,
    "Name": "Peltirosolli",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10522?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Kuori ja lohko porkkanat, perunat, punajuuret ja punasipuli. Laita kasvikset uunipellille leivinpaperin päälle osioittain, punajuuret reunimmaiseksi. Säästä pari punajuurilohkoa kermavaahdon värjäämistä varten.\n# Yhdistä vinegrettin ainekset keskenään ja kääntele puolet seoksesta kasvisten joukkoon. Paista kasviksia 200-asteisessa uunissa ensin 30 minuuttia.\n# Raasta halloumi karkeaksi. Rouhi mantelit veitsellä ja sekoita halloumin joukkoon. Ripottele seos kasvisten päälle. Jatka kypsentämistä noin 15 minuuttia, kunnes punajuuretkin ovat kypsiä. Valuta loppu vinegretti peltirosollin päälle.\n# Rosollin kypsyessä viipaloi jäljelle jääneet punajuuret ohuen ohuiksi viipaleiksi kulhoon. Lisää kerma ja heiluttele kulhoa niin, että kerma värjääntyy pinkiksi. Kalasta punajuuren palat haarukalla pois. Vaahdota kerma pehmeäksi vaahdoksi. Mausta etikalla ja sokerilla.\n# Tarjoa peltirosolli kuumana pinkin kermavaahdon kanssa.",
    "Ingredients": "porkkanaa\nPirkka yleisperunoita (keltainen pussi)\nPirkka punajuurta\npunasipuli\nrypsiöljyä\nomenaviinietikkaa\ntummaa siirappia\nsuolaa\nmustapippuria\nPirkka Parhaat halloumia\nPirkka Luomu kuorellisia manteleita\nPirkka kuohukermaa\npunajuurilohkoa\nomenaviinietikkaa\nsokeria"
  },
  {
    "Id": 10521,
    "Name": "Etikkakypsennetty siika",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10521?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Nypi siiasta ruodot. Leikkaa filee terävällä veitsellä hieman viistottain puolen sentin paksuisiksi, sashimityylisiksi viipaleiksi. Levitä viipaleet vatiin yhteen kerrokseen.\n# Valuta etikka tasaisesti kaloille. Ripottele päälle suola. Peitä vati kelmulla.\n# Anna kalan raakakypsyä jääkaapissa noin 1 tunti palojen paksuudesta riippuen. Kala on valmista, kun se on muuttunut pinnalta valkoiseksi.\n# Nosta kalapalat vadista tarjoilulautaselle. Pirskota päälle öljy ja ripottele pinnalle sormisuola ja pippuri.  Koristele lehtipersiljalla.",
    "Ingredients": "nahatonta siikafileetä\nvalkoviinietikkaa\nsuolaa\nMonini Gran Fruttato ekstra-neitsytoliiviöljyä\nPirkka Parhaat sormisuolaa\nmustapippuria\nlehtipersiljaa"
  },
  {
    "Id": 10520,
    "Name": "Omenainen kanapata",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10520?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/8EmwZUGnu2w",
    "Instructions": "# Kuori ja lohko salottisipulit neljään osaan. Viipaloi valkoipulinkynnet. Suikaloi pekoni.\n# Nosta broilerin fieepihvit pois marinadista.\n# Kuumenna paistokasari tai laakea pata ja ruskista broilerin fileepihvit öljysssä muutamassa erässä. Siirrä fileepihvit odottamaan lautaselle. Ruskista seuraavaksi pekonit. Lisää sipulit, ja pienennä lämpöä.\n# Siirrä ruskistetut fileepihvit paistokasariin tai pataan pekonien ja sipulien joukkoon.\n# Lisää pataan siideri, vesi ja annosfondi, laakerinlehdet sekä ruokalusikallinen timjamilla.\n# Kuumenna pata kiehuvaksi ja jätä pata porisemaan miedolle lämmölle noin 15 minuutiksi kannenn alle. Pese ja kuutioi sillä välin omenat reiluiksi kuutioiksi.\n# Lisää omenat kanapataan ja keitä vielä toiset 15 minuuttia välillä sekoitellen. Mausta lopuksi mustapippurilla sekä koristele timjamilla.",
    "Ingredients": "Kariniemen kananpojan fileepihvejä, omena-pippuri\nPirkka rypsiöljyä\nHK Amerikan pekonia\nPirkka salottisipulia\nvalkosipulinkynttä\nPirkka Parhaat Cidre Brut Rose -omenasiideriä\nvettä\nKnorr Fond \"du Chef\" kana-annosfondi\nlaakerinlehteä\ntuoretta timjamia hienonnettuna\nhapahkoa omenaa (kotimainen tai Jonagold)\nrouhaisu mustapippuria myllystä"
  },
  {
    "Id": 10519,
    "Name": "Mansikkakiisseli",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10519?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Mittaa mehu ja vesi kattilaan ja sekoita perunajauhot kierrevatkaimella kylmän nesteen joukkoon.\n# Kuumenna kiisseli kiehumispisteeseen ja siirrä sivuun, kun kiisseli pulpahtaa. Lisää joukkoon jäiset tai kohmeiset mansikat. Anna marjojen sulaa ja sekoita tasaiseksi.\n# Kaada kiisseli tarjoiluastiaan ja ripottele pinnalle sokeria kuorettumisen estämiseksi. Tarjoa halutessasi lisäksi kermavaahtoa.",
    "Ingredients": "Pirkka rypäle-mansikkamehutiivistettä\nvettä\nperunajauhoja\nPirkka mansikoita (pakaste)\nsokeria"
  },
  {
    "Id": 10518,
    "Name": "Pikakimchi punakaalista",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10518?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Kiehauta vesi ja suola, anna jäähtyä hetken.\n# Poista punakaalista kanta ja leikkaa kaali ohuen ohuiksi suikaleiksi. Kaada suolavesi kaalin päälle ja anna tekeytyä 10 minuuttia, sekoita välillä pari kertaa.\n# Siirrä kaali siivilään ja huuhtele kunnolla kylmän veden alla. Valuta kaaliraaste kuivaksi.\n# Kuori ja hienonna valkosipulinkynsi. Hienonna myös chili. Sekoita kaikki loput ainekset kaalin joukkoon (viimeisenä korianteri) ja sekoita tasaiseksi. Anna maustua vähintään puoli tuntia jääkaapissa, mielellään seuraavaan päivään, varsinkin, jos käytät vanhan sadon punakaalia, jotta maut ehtivät tasaantua.",
    "Ingredients": "punakaalia\nvettä\nmerisuolaa\nvalkosipulinkynsi\nPirkka mietoa punaista chiliä\ninkivääriä raastettuna\nsokeria\nvalkoviini- tai omenaviinietikkaa\ntomaattisosetta\nPirkka paprikajauhetta\nPirkka kalakastiketta)\ntuoretta korianteria"
  },
  {
    "Id": 10517,
    "Name": "Poropizza",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10517?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Kaada poronkäristys pannulle ja kuumenna. Hienonna kuorittu sipuli. Lisää se voin kanssa sulan käristyksen joukkoon pannulle. Mausta suolalla ja pippurilla. Lisää pannulle vesi ja anna käristyksen hautua kannen alla miedolla lämmöllä noin 30 minuuttia.\n# Sulata perunasoseainekset mikrossa maidon kanssa pakkauksen ohjeen mukaan. Lisää pehmeä voi. Sekoita jauhoihin leivinjauhe ja suola, lisää kuivat aineet muusiin ja vaivaa taikina tasaiseksi. Taputtele taikina jauhojen avulla kahdeksi soikeaksi pohjaksi leivinpaperin päälle uunipellille. Paista 200-asteisessa uunissa 15 minuuttia.\n# Levitä pizzapohjalle juustoraaste ja sen päälle käristys. Paista 200-asteisessa uunissa 15 minuuttia.\n# Koristele pizza timjamilla ja tarjoa puolukkahillon tai -survoksen kanssa.",
    "Ingredients": "Pirkka poronkäristystä (pakaste)\npunasipuli\nvoita\nsuolaa\nmustapippuria\nvettä\nArla Posketon pizzajuustoraastetta\nPirkka perunasoseaineksia (pakaste)\nmaitoa\nvoita\nPirkka ruisjauhoja\nPirkka vehnäjauhoja\nleivinjauhetta\nsuolaa\ntuoretta timjamia\npuolukkahilloa tai -survosta"
  },
  {
    "Id": 10516,
    "Name": "Shahi paneer",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10516?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/qwgfp_y4OH8",
    "Instructions": "# Leikkaa juusto vajaan sentin viipaleiksi. Ruskista palat pannulla ja siirrä sivuun odottamaan\n# Hienonna kuoritut sipulit, valkosipulinkynnet, inkivääri ja chili. Kuumenna öljy kattilassa, lisää kasvikset, kurkuma sekä chilimauste ja kuullota. Kaada kattilaan tomaattimurska. Huuhtele tomaattimurskapurkki vedellä ja kaada neste kattilaan. Lisää cashewpähkinät ja anna hautua 15 minuuttia. Soseuta kastike ja mausta suolalla ja sokerilla.\n# Lisää kastikkeeseen juustopalat. Tarjoa tuoreen korianterin, jogurtin ja keitetyn riisin kanssa.",
    "Ingredients": "Apetina Paneer -juustoa\nsipulia\nvalkosipulinkynttä\ntuoretta inkivääriä\nPirkka mieto punainen chili\nPirkka ekstra-neitsytoliiviöljyä\nkurkumaa\nchilimausteseosta\nPirkka tomaattimurskaa\nvettä\nPirkka cashewpähkinöitä\nsuolaa\nsokeria\ntuoretta korianteria\nPirkka turkkilaista jogurttia\nkeitettyä riisiä"
  },
  {
    "Id": 10515,
    "Name": "Chimichurrilla täytetty naudanfilee",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10515?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Ota naudanfilee huoneenlämpöön noin 30 minuuttia ennen paistamista.\n# Mittaa kaikki chimichurrin ainekset tehosekoittimeen. Sekoita kunnes seos on melko tasaista. Tarkista maku. Ota pari lusikallista chimichurria talteen erilliseen kulhoon kastiketta varten.\n# Leikkaa fileen keskelle terävällä veitsellä syvä tasku ensin sivusuunnassa ja sitten pystysuunnassa. Varo halkaisemasta fileetä ja jätä fileen päät leikkaamatta, jotta täyte pysyy sisällä. Mausta liha suolalla ja pippurilla. Lusikoi chimichurri viiltoon.\n# Sido filee kiinni paistinarulla.\n# Paista fileeseen kaunis väri pannussa öljy-voiseoksessa. Mausta fileen ulkopinta suolalla ja pippurilla ja siirrä filee uunipannuun. Työnnä paistolämpömittari fileen paksuimpaan kohtaan.\n# Kypsennä fileetä 175-asteisessa uunissa, medium-kypsyiseksi 55-58 asteeseen (noin 20 minuuttia) tai kypsemmäksi 64 asteeseen.\n# Kääri liha folioon ja anna levätä noin 15 minuuttia ennen leikkaamista.\n# Sekoita chimichurri ranskankermaan. Tarjoa täytetty sisäfilee ranskankermakastikkeen ja lohkoperunoiden kanssa.",
    "Ingredients": "naudan sisäfileetä\nsuolaa\nmustapippuria\noliiviöljyä\nvoita\ntuoretta lehtipersiljaa\ntuoretta korianteria\nPirkka ekstra-neitsytoliiviöljyä\npunaviinietikkaa\nPirkka valkosipulinkynttä\nPirkka mieto punainen chili\nsokeria\nsuolaa\nPirkka crème fraîchea (ranskankermaa, 18 %)"
  },
  {
    "Id": 10512,
    "Name": "Yksisarvismokkapalat",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10512?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Sulata voi mikrossa isossa kulhossa ja sekoita joukkoon kahvi.\n# Sekoita kuivat aineet keskenään kulhossa. Siivilöi kuivat aineet kahvi-rasvaseokseen.\n# Vatkaa munien rakenne rikki ja sekoita ne taikinaan.\n# Levitä mokkapalataikina leivinpaperin päälle uunipellille ja paista 200 asteessa noin 15 minuuttia. Anna jäähtyä.\n# Vatkaa kaikki kuorrutuksen ainekset isossa kulhossa kuohkeaksi kreemiksi.\n# Levitä kuorrutus jäähtyneen levyn päälle.\n# Piirrä mokkapalalevyyn grillitikulla yksisarvisen ääriviivat. Asettele vaahtokarkkeja yksisarvisen ihoksi ja irtokarkkeja ja sokerihelmiä harjaksi. Tee sarvi pehmeistä hopeahelmistä. Viimeistele yksisarvisen kasvot lakusta leikatulla kulmalla, suulla ja sieraimella sekä sokerisilmällä.",
    "Ingredients": "voita\nvahvaa kahvijuomaa (Pirkka Costa Rica ranskalainen paahto)\nPirkka vehnäjauhoja\nPirkka sokeria\nPirkka kaakaojauhetta (tummaa)\nPirkka leivinjauhetta\nPirkka vaniljasokeria\nkananmunaa\ntomusokeria\npehmeää voita\nvahvaa kahvijuomaa (Pirkka Costa Rica ranskalainen paahto)\nPirkka kaakaojauhetta (tummaa)\nminivaahtokarkkeja\nirtokarkkeja\nkoristerakeita\nlakritsia\npehmeitä hopeahelmiä\nDr. Oetker Sugar eyes -sokerisilmä"
  },
  {
    "Id": 10511,
    "Name": "Keksitikkarit",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10511?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Laita keraaminen piirakkavuoka tai tarjotin pakastimeen kylmenemään.\n# Sulata valkosuklaa miedolla teholla mikrossa.\n# Kasta keksit sulaan suklaaseen. Valuta tarvittaessa suklaata lusikalla keksien päälle niin, että ne peittyvät kokonaan.\n# Nosta keksit leivinpaperin päälle viilennetylle alustalle. Työnnä grillitikut varovasti kekseihin. Ripottele suklaan päälle nomparelleja, sokerirakeita tai kuivattuja kukkia.\n# Siirrä keksitikkarit hetkeksi jääkaappiin jähmettymään ennen herkuttelua. Voit tehdä keksitikkarit valmiiksi jääkaappiin esimerkiksi tarjoilua edeltävänä päivänä.",
    "Ingredients": "Oreo-täytekeksejä, double filled\nPirkka valkoista leivontasuklaata\nnonparelleja tai sokerihelmiä\npuista grillitikkua"
  },
  {
    "Id": 10510,
    "Name": "Nutella-juustokakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10510?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Ota tuorejuustot, munat ja ranskankerma huoneenlämpöön. Sulata täytteen valkosuklaa.\n# Hienonna keksit monitoimikoneessa tai muovipussissa kaulimella. Sekoita joukkoon pähkinälevite. Painele seos leivinpaperilla vuoratun irtopohjavuoan (⌀ 20-22 cm) pohjalle.\n# Sekoita kulhossa tuorejuusto ja vaniljasokeri ja lisää joukkoon munat yksi kerrallaan sekoittaen. Kääntele seokseen myös valkosuklaasula ja ranskankerma. Kaada täyte keksipohjan päälle.\n# Lämmitä pähkinälevitettä mikrossa muutama sekunti. Tiputtele sitä lusikalla täytteen päälle nokareina kahdeksi renkaaksi ja vedä sitten nokareiden läpi grillitikulla, jotta pintaan muodostuu sydämiä.\n# Paista juustokakkua 150-asteisessa uunissa 45 minuuttia. Laita uuni pois päältä ja anna kakun vielä olla jälkilämmössä 30 minuuttia.\n# Anna nutellajuustokakun jäähtyä ja siirrä jääkaappiin yön yli.",
    "Ingredients": "Domino- tai Oreo-keksejä\nNutellaa tai Pirkka hasselpähkinä-kaakaolevitettä\nPirkka maustamatonta tuorejuustoa\nkananmunaa\nPirkka crème fraîchea (ranskankermaa, 18 %)\nPirkka vaniljasokeria\nPirkka valkoista leivontasuklaata\nNutellaa tai Pirkka hasselpähkinä-kaakaolevitettä"
  },
  {
    "Id": 10508,
    "Name": "Joulukakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10508?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Valmista rosmariinikuuset. Mittaa kattilaan vesi ja sokeri (1/2 dl) ja kuumenna sekoitellen, kunnes sokeri liukenee, älä keitä. Anna liemen jäähtyä hetki ja kasta rosmariininoksia liemeen. Anna oksien kuivua tunti leivinpaperin päällä. Kierittele oksat sitten sokerissa (1/2 dl) ja anna kuivua pari tuntia tai yön yli.\n# Voitele ja korppujauhota irtopohjavuoka (ø 20 cm) ja kiinnitä pohjalle leivinpaperi.\n# Hienonna taatelit veitsellä. Pane ne isohkoon teräskattilaan, jossa mahdut tekemään koko taikinan. Lisää appelsiinimehu ja sokeri. Keitä kannen alla 10-15 minuuttia, kunnes taatelit hieman pehmenevät. Soseuta seos sauvasekoittimella.\n# Paloittele rasva taateleiden joukkoon. Sekoita, kunnes rasva on sulanut. Anna soseen jäähtyä kädenlämpöiseksi.\n# Vatkaa munat sähkövatkaimella yksitellen taateliseoksen joukkoon.\n# Sekoita jauhot, vaniljasokeri, kaneli, leivinjauhe ja sooda keskenään. Lisää jauhoseos taikinaan. Vältä turhaa sekoittamista. Lusikoi taikina vuokaan.\n# Paista 175 asteessa uunin alatasolla noin tunnin ajan. Tarkista kypsyys tikulla. Anna jäähtyä.\n# Ota täytteen tuorejuustot huoneenlämpöön. Vatkaa pehmeä voi, tomusokeri, vaniljasokeri ja mehu kuohkeaksi vaaleaksi kreemiksi sähkövatkaimella. Tähän menee aikaa useita minuutteja. Kääntele notkistettu tuorejuusto vaniljakreemin joukkoon.\n# Leikkaa jäähtynyt kakku sahateräisellä veitsellä kolmeen osaan. Kakku leikkaantuu parhaiten, kun leivot sen edellisenä päivänä.\n# Nosta alin kakkulevy tarjoiluvadille. Kostuta appelsiinimehulla ja levitä päälle appelsiinimarmeladia ja täytekreemiä. Tee toinen kerros samoin ja nosta kansi päälle. Levitä loppu kreemi kakun päälle ja reunoille leveällä veitsellä.\n# Suihki kakun päälle kultasprayta. Koristele kakku rosmariinikuusilla, koristehelmillä ja halutessasi pestyillä muovieläimillä. Säilytä kakku jääkaapissa ennen tarjoamista.",
    "Ingredients": "Pirkka pehmeitä taateleita\nPirkka appelsiinitäysmehua\nPirkka sokeria\nPirkka voita\nkananmunaa\nvehnäjauhoja\nvaniljasokeria\nkanelia\nleivinjauhetta\nruokasoodaa\nvoita\nkorppujauhoja\nPirkka maustamatonta tuorejuustoa\nPirkka voita\ntomusokeria\nvaniljasokeria\nPirkka appelsiinitäysmehua\nPirkka appelsiinitäysmehua\nPirkka appelsiinimarmeladia\nDr. Oetker kimallesuihketta, kulta\nDr. Oetker Pearls Golden and Shiny -koristehelmiä\nvettä\nsokeria\nrosmariinia"
  },
  {
    "Id": 10507,
    "Name": "Porkkanalaatikkopihvit",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10507?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Sekoita porkkanalaatikon rakenne rikki.\n# Nosta salaattijuustokuutiot öljymarinadista kulhoon. Riko niiden rakenne haarukalla. Hienonna yrtit ja kuoritut valkosipulinkynnet.\n# Lisää juustoseokseen porkkana­laatikko, yrtit, valkosipulit, kananmunat, korppujauhot sekä pippuri ja sekoita tasaiseksi.\n# Paista taikina pihveiksi paistinpannulla öljyssä.\n# Valmista perunasose pakkauksen ohjeen mukaan. Sekoita ranskankerma ja salviapesto keskenään kastikkeeksi. Tarjoa porkkanalaatikkopihvit perunasoseen ja salviakastikkeen kanssa.",
    "Ingredients": "Saarioinen porkkanalaatikkoa\nPirkka salaattijuustokuutioita öljymarinadissa\nlehtipersiljaa\nruohosipulia\nvalkosipulinkynttä\nkananmunaa\nkorppujauhoja\nmustapippuria\nrypsiöljyä\nPirkka perunasoseaineksia (pakaste)\nmaitoa\nPirkka crème fraîchea (ranskankermaa, 18 %)\nPirkka salviapestoa"
  },
  {
    "Id": 10506,
    "Name": "Tilli-ricottatahna",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10506?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Paahda valkosipulia 175-asteisessa uunissa noin 40 minuuttia. Anna jäähtyä.\n# Notkista ricotta kulhossa. Leikkaa valkosipulin kärjestä pala pois ja purista valkosipulitahna ricotan joukkoon.\n# Hienonna tilli. Kääntele juustoon tilli, oliiviöljy, sitruunanmehu, suola ja pippuri. Tarkista maku.\n# Tarjoa tilli-ricottatahna juureslastujen kanssa.",
    "Ingredients": "Pirkka valkosipuli\nPirkka Parhaat ricottaa\ntuoretta tilliä\noliiviöljyä\nsitruunanmehua\nsuolaa\nmustapippuria\nPirkka juureslastuja"
  },
  {
    "Id": 10504,
    "Name": "Savusilakkamousse",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10504?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Perkaa savusilakoista nahka, pää ja ruodot pois. Murenna silakat karkeasti tarjoilukulhoon.\n# Keitä munat koviksi, eli 8 minuuttia. Kuori ja hienonna ne. Leikkaa kuorittu punasipuli pieniksi kuutioiksi. Hienonna ruohosipuli.\n# Vatkaa kuohukerma vaahdoksi.\n# Lisää kermavaahto, ranskankerma, sitruunanmehu, suola sekä pippuri kulhoon ja kääntele ainekset varovasti sekaisin.\n# Anna savusilakkamoussen maustua jääkaapissa noin puoli tuntia ennen tarjoamista.\n# Tarjoa savusilakkamousse esimerkiksi juures- tai perunalastujen kanssa.",
    "Ingredients": "kokonaisia savusilakoita\nkananmunaa\npunasipuli\nruohosipulia\nArla Luomu kuohukermaa\nArla Lempi crème fraîchea\nsitruunanmehua\nsuolaa\nmustapippuria\nPirkka juureslastuja"
  },
  {
    "Id": 10503,
    "Name": "Mätimousse",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10503?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Valuta mätiä tiheässä siivilässä jääkaapissa noin puoli tuntia.\n# Leikkaa kuoritut salottisipulit pieniksi kuutioiksi.\n# Vatkaa kerma vaahdoksi. Sekoita vaahtoon smetana, sipulit, sitruunanmehu ja valkopippuri. Kääntele lopuksi joukkoon mäti. Säästä halutessasi lusikallinen mätiä moussen koristeluun.\n# Tarjoa mätimousse maalaisperunalastujen kanssa.",
    "Ingredients": "Pirkka kirjolohenmätiä, käsinlypsettyä\nPirkka salottisipulia\nArla Luomu kuohukermaa\nArla Lempi smetanaa\nsitruunanmehua\nvalkopippuria\nPirkka maalaisperunalastuja"
  },
  {
    "Id": 10502,
    "Name": "Piimälimppu",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10502?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Lämmitä piimä kädenlämpöiseksi. Liuota piimään murennettu hiiva, siirappi, suola ja morttelissa rouhitut mausteet.\n# Sekoita ruisjauhot ja hiivaleipäjauhot nesteeseen. Vaivaa taikinaa noin 10 minuuttia ja lisää vaivauksen loppuvaiheessa myös öljy.\n# Anna taikinan kohota liinan alla kaksinkertaiseksi.\n# Vaivaa taikinasta ilmakuplat ja jaa taikina kahteen osaan. Leivo palat pyöreiksi leiviksi. Anna piimälimppujen kohota puoli tuntia liinan alla.\n# Paista limppuja 200-asteisen uunin alatasolla noin 15 minuuttia.\n# Kiehauta sillä aikaa vesi ja siirappi. Ota leivät uunista ja voitele ne siirappivedellä.\n# Paista piimälimppuja vielä noin 25 minuuttia. Kypsä piimälimppu kumisee, kun sitä kopauttaa pohjasta.",
    "Ingredients": "Pirkka rasvatonta piimää\ntuorehiivaa\ntummaa siirappia\nsuolaa\nfenkolia\nkuminaa\nPirkka ruisjauhoja\nPirkka hiivaleipävehnäjauhoja\nPirkka rypsiöljyä\nvettä\ntummaa siirappia"
  },
  {
    "Id": 10501,
    "Name": "Persimonsmoothie",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10501?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Pese ja kuutioi persimonit.\n# Soseuta persimonkuutiot, hieman kohmeiset mangot, tyrnit ja appelsiinimehu tasaiseksi juomaksi tehosekoittimella tai sauvasekoittimella. Nauti heti.",
    "Ingredients": "Pirkka persimonia\nPirkka mangokuutioita (pakaste)\nPirkka tyrnimarjoja (pakaste)\nappelsiinimehua"
  },
  {
    "Id": 10500,
    "Name": "Joulutorttukierteet",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10500?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://www.youtube.com/watch?v=kH8qUHhTAvA",
    "Instructions": "# Sulata lehtitaikinalevyt pakkauksen ohjeen mukaan.\n# Levitä kolmelle levylle luumumarmeladia ja paina toiset levyt niiden päälle.\n# Leikkaa levyt pitkittäin neljään osaan terävällä veitsellä tai saksilla.\n# Ota suikale käteen ja venytä sitä varovasti. Kieputa suikaleita päistä vastakkaisiin suuntiin ja kääri leivinpaperin päällä sykeröksi. Jätä päät alapuolelle. Tee samoin loput suikaleet.\n# Voitele joulutorttukierteet munalla. Paista 225-asteisessa uunissa noin 15 minuuttia.\n# Siivilöi torttujen päälle tomusokeria.",
    "Ingredients": "Pirkka lehtitaikinalevyjä (pakaste)\nluumumarmeladia, paistonkestävää\nPirkka Luomu kananmuna\ntomusokeria"
  },
  {
    "Id": 10499,
    "Name": "Itsenäisyyspäivän kakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10499?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Voitele kakkuvuoka (⌀ 20 cm) ja pingota vuoan pohjalle leivinpaperi.\n# Vatkaa kulhossa kananmunan rakenne rikki ja lisää kaikki loput ainekset. Sekoita taikinaksi ja levitä vuokaan. Paista pohjaa 175-asteisen uunin alatasolla noin 12 minuuttia. Anna pohjan jäähtyä vuoassa.\n# Vuoraa pieni teräskattila (⌀ 14-15 cm) tai muu vastaava astia muovikelmulla. Pane liivatelehdet likoamaan kylmään veteen. Soseuta sulaneet mustaherukat ja sokeri keskenään. Mausta kardemummalla.\n# Vatkaa kerma vaahdoksi ja lisää vaahto mustaherukoiden joukkoon. Kuumenna herukkamehu, purista liivatteet kuiviksi ja liuota ne mehuun.\n# Kaada liivateseos mustaherukka-kermaseokseen ohuena nauhana samalla sekoittaen. Kaavi mustaherukkaseos vuoraamaasi astiaan, peitä kelmulla ja nosta jääkaappiin vähintään 3 tunniksi tai yön yli. Kun mustaherukkatäyte on hyytynyt, kumoa se varovasti kakkupohjan keskelle.\n# Piimämoussea varten liota liivatelehdet kylmässä vedessä. Vatkaa kerma vaahdoksi. Kaavi vaniljatangosta siemenet ja lisää ne sokerin kanssa kerman joukkoon. Lisää lopuksi piimä hyvin sekoittaen.\n# Kuumenna vesi ja liuota liivatteet siihen. Kaada liivateseos ohuena nauhana sekoittaen piimäseoksen joukkoon. Kaada piimäseos vuokaan ja peitä vuoka. Nosta jääkaappiin vähintään 5 tunniksi tai yön yli.\n# Kun kakku on hyytynyt, pyöräytä ohuella veitsellä kakku irti vuoasta. Nosta kakku tarjoiluvadille ja murenna päälle marengit juuri ennen tarjoamista, jotta ne eivät vety. Kakku on parhaimmillaan heti hyydyttämisen jälkeen.",
    "Ingredients": "Pirkka Luomu kananmuna\nhuoneenlämpöistä voita\nsokeria\nPirkka vaaleaa gluteenitonta jauhoseosta\nleivinjauhetta\nliivatelehteä\nsuomalaisia mustaherukoita (pakaste)\nsokeria\nkardemummaa\nPirkka laktoositonta vispikermaa\nPirkka mustaherukkamehua (laimentamatonta)\nPirkka rasvatonta piimää\nliivatelehteä\nPirkka laktoositonta vispikermaa\nhalkaistu vaniljatanko\nsokeria\nvettä\nvalmiita marenkeja"
  },
  {
    "Id": 10498,
    "Name": "Kidneypapukastike",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10498?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://www.youtube.com/watch?v=VyUd5saVTak",
    "Instructions": "# Leikkaa sipuli renkaiksi ja paprikat suikaleiksi. Kuullota sipuleita ja paprikoita rasvassa noin 5 minuuttia. Lisää joukkoon valutetut ja huuhdotut pavut sekä tomaattimurska.\n# Mausta salsadipillä ja suolalla. Anna hautua kannen alla 5-10 minuuttia. Lisää valutetut salaattijuustokuutiot. Tarjoa tortillojen tai riisin kanssa.",
    "Ingredients": "sipuli\npaprikaa (punainen ja keltainen)\nöljyä\nPirkka kidneypapuja\nPirkka tomaattimurskaa\nPirkka salsadippiä (keskivahva tai vahva)\nsuolaa\nPirkka salaattijuustokuutioita\nPirkka tortilloja\nPirkka tummaa pikariisiä"
  },
  {
    "Id": 10497,
    "Name": "Muumiomuffinit",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10497?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/-qvSqk_Y2Zs",
    "Instructions": "# Sekoita majoneesi ja maito keskenään. Sekoita kuivat aineet keskenään. Siivilöi ja kääntele kuivat aineet märkien joukkoon.\n# Rouhi suklaa veitsellä ja kääntele seokseen.\n# Lusikoi taikina isoihin muffinivuokiin.\n# Paista 200-asteisessa uunissa 25 minuuttia. Anna muffinien jäähtyä.\n# Sekoita kaikki kuorrutuksen ainekset keskenään. Pursota tai valuta lusikalla kuorrutetta muffineille nauhoiksi.\n# Viimeistele muumiomuffinit sokerisilmillä. Säilytä muumiomuffinit jääkaapissa.",
    "Ingredients": "Hellmann's majoneesia\nmaitoa\nvehnäjauhoja\nsokeria\nPirkka kaakaojauhetta (tummaa)\nvaniljasokeria\nleivinjauhetta\nruokasoodaa\nPirkka tummaa leivontasuklaata (55 %)\ntomusokeria\nHellmann's majoneesia\nsitruunanmehua\nDr. Oetker Sugar eyes -sokerisilmiä\nPirkka amerikan muffinivuokaa"
  },
  {
    "Id": 10496,
    "Name": "Lanttulimppu",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10496?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Kuori ja kuutioi lantut. Lisää kattilaan vettä sen verran, että lanttukuutiot juuri ja juuri peittyvät. Keitä 15-20 minuuttia, kunnes lanttu on pehmeää. Kaada keitinvesi pois ja soseuta lanttu sauvasekoittimella. Mausta suolalla (n. 1/4 tl). (Valmis lanttusose on jo suolalla maustettua.)\n# Mittaa leipää varten 5 dl sosetta. Lämmitä lanttusose noin 42-asteiseksi. Lisää siirappi, suola ja inkivääri. Sekoita hiiva ruisjauhoihin ja lisää seos lanttusoseeseen.\n# Alusta hiivaleipävehnäjauhot taikinaan vähitellen. Lisää öljy alustamisen loppuvaiheessa. Vaivaa taikinaa käsin tai yleiskoneella noin 5 minuuttia.\n# Kohota taikinaa lämpimässä ja vedottomassa paikassa noin 20 minuuttia. Leivo taikinasta 2 pyöreää leipää. Ripottele leipien pinnalle hiivaleipävehnäjauhoja.\n# Anna kohota vielä noin 30 minuuttia. Pistele leivät varovasti. Paista leipiä 200 asteessa uunin alatasolla 30-40 minuuttia.\n# Kiehauta vesi ja siirappi kattilassa. Voitele leivät siirappivedellä paistamisen puolivälissä ja heti uunista ottamisen jälkeen.",
    "Ingredients": "lanttua\nsiirappia\nsuolaa\ninkivääriä\nPirkka kuivahiivaa\nruisjauhoja\nhiivaleipävehnäjauhoja\nöljyä\ntummaa siirappia\nvettä"
  },
  {
    "Id": 10494,
    "Name": "Uunisinihomejuustopasta",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10494?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Huuhtele tomaatit ja poista ne rangasta. Valuta öljy pieneen uunivuokaan ja lisää mustapippuri. Pyöräytä tomaatit öljyseoksessa ja nosta juusto tomaattien päälle. Valuta pinnalle hunaja.\n# Paista 200-asteisessa uunissa 15 minuuttia ja jatka paistamista grillivastusten alla vielä 3-5 minuuttia. Varo etteivät tomaatit pala.\n# Keitä sillä välin pasta pakkauksen ohjeen mukaan suolalla maustetussa vedessä.\n# Voit halutessasi painella tomaatit varovasti rikki lusikalla. Kumoa seos kattilaan valutetun pastan joukkoon ja nostele ainekset sekaisin. Viimeistele pasta suikaloidulla basilikalla",
    "Ingredients": "Pirkka Parhaat Red Desire terttuminiluumutomaatteja\nPirkka ekstra-neitsytoliiviöljyä\nmustapippuria\nPirkka sinihomejuustoa\nhunajaa\nPirkka tagliatelle-pastaa\ntuoretta basilikaa suikaloituna"
  },
  {
    "Id": 10493,
    "Name": "Banoffee",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10493?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Murskaa keksit hienoksi muruksi monitoimikoneessa tai pakastepussissa kaulimella päältä painellen. Sulata voi. Sekoita keksimuru ja voisula.\n# Levitä piirakkavuokaan (Ø 22 cm) leivinpaperi. Painele keksiseos vuokaan pohjalle ja reunoille.\n# Nosta pohja jääkaappiin ja anna kovettua ainakin tunnin ajan.\n# Irrota pohja vuoasta. Avaa karamellisoitu maitotiivistepurkki ja levitä kinuski keksipohjalle.\n# Vatkaa kerma pehmeäksi vaahdoksi. Mausta vaniljasokerilla ja pyöräytä tasaiseksi.\n# Leikkaa kuoritut banaanit viipaleiksi. Levitä banaanit toffeelle ja lusikoi vielä kermavaahto kakun päälle.\n# Koristele banoffee suklaarouheella ja suolapähkinöillä.",
    "Ingredients": "Pirkka digestivekeksejä\nPirkka voita sulatettuna\nkaramellisoitua maitotiivistettä (esim. Dovgan)\nbanaania\nPirkka kuohukermaa\nPirkka vaniljasokeria\nPirkka suolapähkinöitä\nPirkka tummaa leivontasuklaata (55 %)"
  },
  {
    "Id": 10492,
    "Name": "Maksakastike",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10492?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Poista maksasta kalvot ja taputtele pinta kuivaksi talouspaperilla. Kuutioi maksa. Kuori ja silppua sipulit. Kuori ja raasta inkivääri.\n# Kuullota sipulit ja inkivääri pannulla ruokalusikallisessa voita. Kumoa ne sivuun odottamaan ja ruskista maksakuutiot lopussa voissa. Kaada sipulit takaisin pannulle ja mausta seos suolalla ja pippurilla.\n# Ripottele joukkoon vehnäjauhot ja kääntele. Kaada pannulle myös vesi, murenneltu lihaliemikuutio ja kerma. Anna maksakastikkeen hautua vielä 5 minuuttia.\n# Tarjoa maksakastike perunamuusin ja puolukkahillon kanssa.",
    "Ingredients": "naudanmaksaa\nPirkka sipulia\ntuoretta inkivääriä\nvoita\nsuolaa\nmustapippuria\nvehnäjauhoja\nvettä\nlihaliemikuutio\nPirkka laktoositonta ruokakermaa\nperunamuusia\nPirkka puolukkahilloa"
  },
  {
    "Id": 10491,
    "Name": "Cheese melt sandwich eli lämpimät kinkku-juustoleivät",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10491?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/-o_sX0VcqH4",
    "Instructions": "# Voitele leivät voilla. Käännä ja voitele toinen puoli sinapilla. Viipaloi juusto kahdelle leivälle. Levitä kinkku päälle. Nosta toiset leivät kansiksi.\n# Paista leivät molemmin puolin paistinpannussa kullanruskeiksi ja niin, että juusto sulaa. Leikkaa leivät kahtia tarjolle.",
    "Ingredients": "Fazer Arjen Ihana Kaura & Hapanjuuri -leipää\nvoita\nPirkka Dijon-sinappia\nPirkka Parhaat cheddaria\nSnellman kotimaista palvikinkkua"
  },
  {
    "Id": 10488,
    "Name": "Kanaa tikka masala",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10488?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Sekoita mausteseoksen ainekset keskenään ja sekoita puolet seoksesta jogurtin joukkoon. Kääntele broilerit jogurtissa ja anna maustua noin puoli tuntia huoneenlämmössä.\n# Suikaloi kuorittu sipuli. Kuullota sipulia voissa yhdessä tomaattisoseen kanssa noin 5 minuuttia. Lisää loput mausteseoksesta ja jatka paistamista vielä muutama minuutti.\n# Kumoa kasariin kuoritut tomaatit liemineen, painele ne lastalla rikki ja kuumenna kiehuvaksi. Peitä kannella ja anna hautua.\n# Kuumenna uunin grillivastukset 250 asteeseen. Peitä uunipelti foliolla ja nosta siihen broilerit. Paista uunin ylätasolla, kunnes broilerit ovat saaneet väriä, noin 10 minuuttia. Jäähdytä hetki ja paloittele broilerit. Lisää ne yhdessä jogurtin kanssa kastikkeen joukkoon.\n# Hienonna päälle lopuksi korianteria ja tarjoa kastike riisin kanssa.",
    "Ingredients": "Pirkka broilerin ohutleikkeitä, maustamaton\ninkivääriä raastettuna\nvalkosipulinkynttä raastettuna\nkurkumaa\nPirkka Luomu juustokuminaa\npaprikajauhetta\njauhettua korianteria\ngaram masala -maustesekoitusta\nsuolaa\nPirkka turkkilaista jogurttia\nsipuli\nvoita tai kirkastettua voita\nPirkka tomaattisosetta\nK-Menu kuorittuja tomaatteja tomaattimehussa\nPirkka turkkilaista jogurttia\nkorianteria hienonnettuna"
  },
  {
    "Id": 10479,
    "Name": "Kylmä kurkkukeitto",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10479?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Pilko kurkut hiukan pienemmiksi, kuori valkosipulinkynsi, poista chilistä siemenet. Korianterin voit käyttää varsineen, nypi basilikasta lehdet.\n# Laita ainekset tehosekoittimeen. Purista mukaan ensin yhden sitruunan mehu, aja tasaiseksi keitoksi ja lisää enemmän sitruunaa jos kaipaat lisää hapokkuutta.\n# Viilennä keitto hyvin. Liian paksua keittoa voi ohentaa kylmällä vedellä tai lisätä joukkoon jääpaloja.",
    "Ingredients": "Pirkka Luomu pikkukurkkua\nvalkosipulinkynsi\ntuoretta korianteria\ntuoretta basilikaa\nkreikkalaista jogurttia\noliiviöljyä\nsitruunan mehu\ntuore vihreä chilipalko\nsuolaa\nversoja, sipulinvarsia tai ruohosipulia ja mustikoita"
  },
  {
    "Id": 10478,
    "Name": "Gluteenittomat manteli-sitruunapullat",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10478?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Sulata pullataikina pakkauksen ohjeen mukaan.\n# Sekoita huoneenlämpöinen voi, sokeri, manteli ja sitruuna notkeaksi tahnaksi.\n# Kauli taikinasta suorakaiteen muotoinen levy ja levitä täyte levyn päälle. Kääri rullalle ja leikkaa 16 palaan. Nosta palat paperisiin pullavuokiin. Kohota leivinliinan alla noin 30 minuuttia.\n# Voitele pullat kanamunalla ja ripottele pinnalle mantelilastut. Paista 200-asteisessa uunissa 15-20 minuuttia.",
    "Ingredients": "Pirkka gluteenitonta pullataikinaa (pakaste)\nhuoneenlämpöistä voita\nruokosokeria\nPirkka mantelirouhetta\nsitruunan mehu\nkananmuna\nPirkka mantelilastuja\npaperisia pullavuokia"
  },
  {
    "Id": 10476,
    "Name": "Jouluinen juustokakku ilman liivatetta",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10476?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Hienonna keksit monitoimikoneen leikkuuterällä tai sauvasekoittimella. Sulata voi ja sekoita se keksimuruihin.\n# Pingota irtopohjavuoan (⌀ 22-24 cm) pohjalle leivinpaperi. Painele keksi-voiseos vuoan pohjalle. Nosta vuoka hetkeksi kylmään,\n# Vaahdota 2 dl vispikermaa. Notkista tuorejuustot ja sekoita joukkoon niiden joukkoon fariinisokeri ja inkivääri.\n# Kaada 2 dl vispikerma kattilaan ja sekoita joukkoon agar agar -jauhe kierrevatkaimella. Kuumenna seos kiehuvaksi koko ajan sekoittaen ja keitä 2 minuuttia.\n# Vatkaa koko ajan sähkövatkaimella samalla, kun kaadat kuuman seoksen tuorejuustomassan joukkoon. Agar agar jähmettyy helposti paakuiksi, joten helpointa on, jos toinen henkilö käyttää vatkainta samalla, kun kaadat kuumaa kermaa kattilasta.\n# Kaada kakkumassa heti keksipohjan päälle ja tasoita pinta. Anna jähmettyä jääkaapissa yön yli. Kakku saa jäädä melko pehmeäksi.\n# Kuori päärynät ja pane ne kattilaan glögin ja vaniljasokerin kanssa. Kuumenna kiehuvaksi ja anna hautua miedolla lämmöllä noin 5 minuuttia. Anna jäähtyä ja siirrä jääkaappiin yön yli. Voit laittaa päärynöiden pintaan kelmun ja kevyen painon, jotta ne peittyvät glögiin ja värjääntyvät tasaisesti.\n# Nosta päärynät glögiliemestä. Mittaa 5 dl glögiä kattilaan ja sekoita kylmän glögin joukkoon 1 rkl perunajauhoja. Kuumenna sekoittaen kunnes glögi kiehahtaa ja on suurustunut kastikkeeksi. Jäähdytä glögikastike.\n# Irrota kakku varovasti vuosta, käytä veistä apuna reunojen irrottamisessa. Siirrä kakku tarjoiluvadille. Upota glögipäärynät yksi kerrallaan glögikastikkeseen, jotta saat niiden pinnasta kiiltävän. Nosta päärynät kakun päälle juuri ennen tarjoamista. Tarjoa loppu glögikastike kakun kanssa.",
    "Ingredients": "Pirkka Elise kandisokerikeksejä\nvoita\nPirkka laktoositonta vispikermaa\nPirkka vaniljatuorejuustoa\nfariinisokeria\nPirkka inkivääriä\nMeira agar agar -jauhetta\npientä päärynää\nPirkka Parhaat luomuglögiä\nMeira ruokovaniljasokeria\nperunajauhoja"
  },
  {
    "Id": 10472,
    "Name": "Teriyakikana",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10472?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Mittaa kastikkeen ainekset pieneen kattilaan ja sekoita tasaiseksi kierrevatkaimella. Kuumenna koko ajan sekoittaen, kunnes seos paksuuntuu. Anna kastikkeen jäähtyä.\n# Pyyhi broilereiden pinta talouspaperilla ja pane ne marinoitumaan teriyakikastikkeeseen huoneenlämpöön puoleksi tunniksi ennen paistamista.\n# Paista broilerit kypsiksi öljyssä pannulla. Sivele fileille marinadia paistamisen aikana. Viipaloi kypsät broilerit.\n# Revi jääsalaatti ja korianteri vadille. Halkaise kurkku pitkittäin. Kaavi halutessasi siemenet pois lusikalla ja leikkaa paksuiksi viipaleiksi. Mausta kurkku riisiviinietikalla, sokerilla ja suolalla. Sekoita kurkut salaatin joukkoon ja valuta salaatille oliiviöljyä.\n# Halkaise avokado, poista kuori ja kivi. Viipaloi hedelmäliha.\n# Nosta salaatin pinnalle viipaloidut broilerit ja avokadot. Ripottele broilereille seesaminsiemeniä ja koristele salaatti kevätsipulilla.",
    "Ingredients": "Pirkka japanilaista soijakastiketta\nPirkka riisiviinietikkaa\nruokokidesokeria\nvalkosipulinkynsi hienonnettuna\nPirkka inkivääriä\nmaissitärkkelystä\nKariniemen kananpojan rintafileetä, annospakattu\nöljyä\nseesaminsiemeniä paahdettuna\nPirkka jääsalaattia\nkorianteria\nkurkku\nriisiviinietikkaa\nsokeria\nsuolaa\nPirkka ekstra-neitsytoliiviöljyä\nPirkka syöntikypsä avokado\nPirkka kevätsipulinvartta hienonnettuna"
  },
  {
    "Id": 10471,
    "Name": "Paahdettu lanttusalaatti",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10471?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Kuori lantut ja leikkaa ne reiluiksi lohkoiksi. Pyörittele lantut öljyssä, vaahterasiirapissa ja mausteissa. Kaada lantut pellille leivinpaperin päälle ja paahda 225 asteessa noin 25 minuuttia. Lantut saavat jäädä hieman napakoiksi. Anna jäähtyä.\n# Paahda hasselpähkinät kuivalla pannulla, rouhi veitsellä pienemmäksi.\n# Sekoita kastikkeen ainekset kierrevatkaimella keskenään. Levitä rucolat laakealle vadille, valuta pinnalle noin puolet kastikkeesta.\n# Nostele lantut vadille ja murenna pinnalle sinihomejuusto. Valuta loppu kastike salaatille ja koristele hasselpähkinöillä sekä tuoreella timjamilla.",
    "Ingredients": "Pirkka lanttuja\nrypsiöljyä\nPirkka vaahterasiirappia\nkanelia\nsuolaa\nmustapippuria\nPirkka Luomu hasselpähkinöitä\nPirkka Luomu rucolaa\nCastello Crumbly Blue juustoa\ntuoretta timjamia\nPirkka ekstra-neitsytoliiviöljyä\nPirkka balsamiviinietikkaa\nsuolaa"
  },
  {
    "Id": 10470,
    "Name": "Bataatti-punajuurisalaatti",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10470?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Kuori bataatti ja punajuuret, leikkaa ne reiluiksi paloiksi. Levitä kasvikset pellille leivinpaperin päälle omille reunoilleen, jotta punajuuri ei värjää bataattia. Pyörittele joukkoon öljy ja mausteet.\n# Paahda kasviksia 225 asteisessa uunissa noin 35 minuuttia, punajuuret saavat jäädä hieman napakoiksi.\n# Keitä ohrasuurimot pakkauksen ohjeen mukaan suolalla maustetussa vedessä. Huuhdo kypsä ohra kylmän veden alla ja valuta se.\n# Raasta appelsiinin kuori (1 rkl) ja purista mehu (1/2 dl) kulhoon. Sekoita joukkoon kierrevatkaimella oliiviöljy, suola ja pippuri. Sekoita marinadi ohran joukkoon ja anna tekeytyä hetki kylmässä.\n# Kuori punasipuli ja leikkaa se ohuiksi suikaleiksi. Sekoita sipulin joukkoon punaviinietikka, sokeri ja suola. Lisää halutessasi joukkoon pari kypsää punajuurilohkoa antamaan väriä.\n# Sekoita valkosipulikastikkeen ainekset keskenään ja anna tekeytyä hetki jääkaapissa.\n# Ruskista härkäpapusuikaleet pannulla. Kokoa salaatti laakealle vadille ja tarjoa kastike erikseen. Koristele timjaminoksilla.",
    "Ingredients": "bataatti\nPirkka punajuuria\nPirkka ekstra-neitsytoliiviöljyä\nvalkosipulinkynsi hienonnettuna\ntimjamia\nmustapippuria\nsuolaa\nPirkka esikypsytettyjä rikottuja ohrasuurimoita\nappelsiini\nPirkka ekstra-neitsytoliiviöljyä\nsuolaa\nmustapippuria\npunasipuli\npunaviinietikkaa\nsokeria\nsuolaa\nkaurafraichea (esim. Yosa tai Oatly)\nvalkosipulinkynsi\nmustapippuria\nsuolaa\nBeanit lempeä sitruuna härkäpapusuikaleita\nPirkka Luomu babypinaattia\ntuoretta timjamia"
  },
  {
    "Id": 10469,
    "Name": "Punajuuri-valkosuklaakaakao",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10469?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Raasta kuoritut punajuuret raastimen hienolla terällä.\n# Sekoita punajuuriraaste kylmän maidon joukkoon ja anna värin irrota hetki. Siivilöi punajuuriraaste pois maidon joukosta.\n# Vaahdota kerma ja mausta kermavaahto vaniljasokerilla.\n# Rouhi valkosuklaa, jätä hieman koristeeksi ja lisää loput maidon kanssa kattilaan. Kuumenna koko ajan sekoittaen, kunnes valkosuklaa on sulanut ja kaakao on kuumaa.\n# Annostele  punajuuri-valkosuklaakaakao kuumaa kestäviin laseihin ja pursota pinnalle kermavaahtoa. Ripottele pinnalle valkosuklaarouhetta ja tarjoa heti.",
    "Ingredients": "Pirkka punajuurta\nkevytmaitoa\nPirkka laktoositonta vispikermaa\nPirkka valkoista leivontasuklaata\nvaniljasokeria"
  },
  {
    "Id": 10468,
    "Name": "Sushisilakat",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10468?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Sekoita etikkaliemen ainekset keskenään ja kaada kulhoon silakkafileiden päälle. Anna tekeytyä jääkaapissa kelmulla peitettynä vähintään 3 tuntia tai kunnes liha on muuttunut valkoiseksi.\n# Paahda seesaminsiemenet kevyesti pannulla. Leikkaa merilevä saksilla lyhyiksi suikaleiksi.\n# Valuta silakat siivilässä hyvin liemestään. Vedä selkäevät ja halutessasi nahka pois. Rullaa silakat yksitellen ja aseta ne pystyyn tarjoiluastiaan tiiviisti.\n# Sekoita wasabi ranskankerman joukkoon ja levitä seos silakoiden pinnalle.  Koristele silakat levällä ja seesaminsiemenillä. Tarjoa halutessasi soijakastikkeen kanssa.",
    "Ingredients": "pieniä silakkafileitä\nPirkka riisiviinietikkaa\nvettä\nhienoa merisuolaa\nsokeria\nmustia ja vaaleita seesaminsiemeniä\nsushi nori merilevää\nPirkka crème fraîchea (ranskankermaa, 18 %)\nwasabia\n(Pirkka japanilaista soijakastiketta)"
  },
  {
    "Id": 10465,
    "Name": "Hoisintofu",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10465?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Tee kastike. Hienonna inkivääri, valkosipuli ja chili kulhoon. Sekoita loput ainekset joukkoon.\n# Puristele tofua talouspaperin välissä niin, että kaikki irtoava neste imeytyy paperiin. Kuutioi tofu.\n# Kuumenna öljy kasarissa. Paista tofua muutama minuutti. Sekoita kastike joukkoon, kiehauta ja nosta kasari liedeltä.\n# Keitä nuudelit pakkauksen ohjeen mukaan ja huuhtaise kylmällä vedellä, niin ne eivät takerru toisiinsa.\n# Tarjoa tofu nuudelien, hienonnetun kevätsipulin ja limetinlohkojen kanssa.",
    "Ingredients": "Pirkka luomu tofua\nseesamiöljyä\ninkivääriä hienonnettuna\nvalkosipulinkynttä\nPirkka mieto punainen chili\nPirkka hoisinkastiketta\nvettä\nsoijakastiketta\nseesamiöljyä\nsokeria\nPirkka Parhaat riisinuudelia\nkevätsipulinvartta\nlimetti"
  },
  {
    "Id": 10464,
    "Name": "Paahdettu kurpitsakeitto",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10464?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/Mtv790iyMgA",
    "Instructions": "# Kuori kurpitsa ja paloittele se pataan tai uunin kestävään kattilaan. Pirskota öljy ja suola päälle. Kypsennä  225-asteisessa uunissa, ilman kantta noin 30-40 minuuttia, kunnes kurpitsa on aivan pehmeää.\n# Ota pata uunista. Lisää kerma, voit jättää sitä tilkan annosten päälle. Lisää fondi ja sahrami. Soseuta keitto tasaiseksi ja lisää kuumaa vettä sen verran, että koostumuksesta tulee sopivan pehmeä.\n# Koristele keitto juureslastuilla.",
    "Ingredients": "kuorittua, paloiteltua kurpitsaa\noliiviöljyä\nsuolaa\nArla Lempi Fraîche -kermaa\nkasvisfondia\nsahramia\nkiehuvan kuumaa vettä\nPirkka juureslastuja"
  },
  {
    "Id": 10463,
    "Name": "Halloweenbagelit",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10463?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Lämmitä vesi +42-asteiseksi. Lisää joukkoon suola ja sokeri. Sekoita kuivahiiva jauhojen joukkoon ja vatkaa joukkoon osa jauhoista. Alusta taikinaan vähitellen loput vehnäjauhot, lisää loppuvaiheessa myös jäähtynyt voisula. Vaivaa taikinaa, kunnes se irtoaa käsistä ja kulhon reunoista.\n# Jaa taikina kahteen osaan ja sekoita toiseen puoleen taikinaa geeliväri.  Kohota taikinoita kulhoissa liinan alla lämpimässä paikassa 20-30 minuuttia.\n# Leivo taikinat jauhotetulla pöydällä pitkiksi tangoiksi (n. 50 cm). Yhdistä tangot vierekkäin ja jaa 10 palaan. Pyöritä palat pulliksi ja kohota liinan alla noin 15 minuuttia.\n# Kuumenna vesi kiehuvaksi isossa kattilassa. Paina pullan keskelle reikä peukalolla ja venytä rinkeliksi. Pudota enintään kolme rinkeliä kerrallaan veteen ja keitä 30-40 sekuntia. Nosta rinkelit reikäkauhalla pellille leivinpaperin päälle ja ripottele päälle siemeniä.\n# Paista 225-asteisen uunin keskitasolla noin 15 minuuttia eli kunnes vaalea osa on ruskistunut.\n# Halkaise rinkelit jäähtyneinä. Paahda bagelit halutessasi. Levitä rinkelinpuolikkaille tuorejuustoa, asettele leiville kylmäsavulohiviipaleet ja nosta kannet päälle.",
    "Ingredients": "vettä\nsuolaa\nsokeria\nPirkka kuivahiivaa\nvehnäjauhoja\nvoita tai leivontamargariinia sulatettuna\nDr. Oetker mustaa geeliväriä\nunikonsiemeniä\nmustia seesaminsiemeniä\nPirkka maustamatonta tuorejuustoa\nPirkka kylmäsavukirjolohiviipaleita"
  },
  {
    "Id": 10462,
    "Name": "Harissatahna",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10462?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Paahda siemenet kuivalla pannulla ja jauha ne sauvasekoittimen myllyssä tai tukevassa morttelissa jauheeksi. Lisää mausteseokseen juustokumina ja suola.\n# Kuori valkosipulinkynnet ja sipuli. Paloittele sipuli ja paprika. Poista chileistä kanta. Poista siemenet halutessasi. Laita kaikki ainekset monitoimikoneen kulhoon ja aja tasaiseksi.\n# Kumoa seos paistinpannulle ja paista sekoitellen noin 15 minuuttia. Lisää lopuksi mukaan mausteseos.\n# Siirrä tahna puhtaaseen kuumennettuun tölkkiin. Harissatahna säilyy jääkaapissa noin viikon tai pakastimessa kaksi kuukautta.",
    "Ingredients": "korianterinsiemeniä\nfenkolinsiemeniä\nPirkka Luomu juustokuminaa\nsuolaa\nvalkosipulinkynttä\nPirkka punasipuli\npunainen paprika\nkeskikokoista punaista chiliä\nPirkka Luomu ekstra-neitsytoliiviöljyä"
  },
  {
    "Id": 10461,
    "Name": "Caldo verde eli portugalilainen makkarakeitto",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10461?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Purista siskonmakkarasta nokareita ja paista ne kattilassa öljyssä (1 rkl), kunnes ne ovat kauniin ruskeita. Siirrä sivuun odottamaan.\n# Pese, kuori ja kuutioi perunat. Hienonna sipuli ja valkosipulinkynnet.\n# Kuumenna loppu öljy kattilassa. Lisää paprikajauhe ja halutessasi chilijauhe. Lisää perunat ja sipulit ja kuullota niitä sekoittaen noin 5 minuuttia. Kaada kattilaan 1/2 l vettä ja lisää fondi. Keitä, kunnes perunat ovat pehmenneet.\n# Soseuta perunat survimella tai sauvasekoittimella. Lisää kattilaan loput vedestä, suola, lehtikaalisuikaleet sekä pavut. Kuumenna kiehuvaksi ja lisää siskonmakkarat sekä sitruunankuoriraaste. Peitä kannella ja anna hautua muutama minuutti.",
    "Ingredients": "Pirkka siskonmakkaraa\nPirkka rypsiöljyä\njauhoista perunaa (punainen pussi)\nsipuli\nvalkosipulinkynttä\npaprikajauhetta\nchilijauhetta)\nvettä\nkanafondia\nsuolaa\nPirkka lehtikaalisuikaleita\nPirkka isoja valkoisia papuja\nPirkka (Luomu)sitruunan kuori raastettuna"
  },
  {
    "Id": 10460,
    "Name": "Karitsa-kikhernecurry",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10460?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Paahda mausteseoksen mausteita kuivalla pannulla, kunnes niistä irtoaa tuoksua. Siirrä sivuun jäähtymään hetkeksi ja aja mausteet jauheeksi sauvasekoittimen myllyssä tai jauha ne isossa morttelissa. Siivilöi seos.\n# Kuori ja hienonna keltasipulit. Kuutioi tomaatit. Raasta pieneen kulhoon valkosipulit ja inkivääri, sekoita raasteet keskenään.\n# Kuumenna öljy paistokasarissa tai padassa. Ruskista siinä karitsan jauheliha kahdessa erässä ja siirrä jauheliha sivuun. Jätä karitsasta irronnutta rasvaa pataan, jos mahdollista.\n# Kuullota padassa sipulit. Lisää valkosipuli-inkivääritahna, chilijauhe, mausteseos ja suola. Paista sekoitellen muutama minuutti ja lisää sitten tomaatit, jauheliha ja valutetut kikherneet.\n# Lisää vesi ja kuumenna kiehuvaksi. Anna hautua kannen alla 15 minuuttia. Lisää lopuksi pinaatti. Tarjoa curry keitetyn riisin kanssa.",
    "Ingredients": "korianterinsiemeniä\nkokonaisia juustokuminansiemeniä\nkokonaisia kardemummansiemeniä\nkokonaisia neilikoita\njauhettua muskottipähkinää\ntähtianis\nlaakerinlehteä\nsipulia\nvalkosipulinkynttä\npieni pala (n. 4 cm) inkivääriä\nkypsää tomaattia\nrypsiöljyä\n(luomu) karitsan jauhelihaa\nchilijauhetta\nsuolaa\nvettä\nPirkka Luomu kikherneitä\nPirkka Luomu babypinaattia"
  },
  {
    "Id": 10459,
    "Name": "Kuusenkerkkälatte",
    "PieceSize_Unit": "ml",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10459?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Sekoita kuusenkerkkäjauhe pieneen tilkkaan kaurajuomaa. Lisää hunaja.\n# Kuumenna ja vaahdota loppu kaurajuoma maidonvaahdottimella. Lisää vaahto mukiin ja nauti kuusenkerkkälatte heti.",
    "Ingredients": "Pirkka kaurajuomaa\nkuusenkerkkäjauhetta (Arctic Warriors)\nPirkka juoksevaa hunajaa"
  },
  {
    "Id": 10458,
    "Name": "Pad thai eli paistetut nuudelit",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10458?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/ALG8qqTmXmE",
    "Instructions": "# Viipaloi tofu, kuivaa palat talouspaperilla ja leikkaa pieniksi kuutioiksi. Ruskista tofukuutiot, broileri ja valkosipulit öljyssä. Lisää kananmuna ja kypsennä sekoitellen. Siirrä sivuun itujen, porkkanasuikaleiden ja paloitellun (noin 3 cm) kevätsipulin kanssa.\n# Kaada vesi ja keskenään sekoitetut kastikkeen ainekset kuumalle pannulle. Kiehauta ja lisää joukkoon nuudelit. Keitä sekoitellen, kunnes nuudelit ovat kypsiä ja vesi on lähes täysin haihtunut.\n# Kaada joukkoon kaikki muut ainekset ja kuumenna vielä hetki. Maista ja lisää tarvittaessa suolaisuutta (kalakastiketta). Lisää annoksiin lopuksi rouhittuja maapähkinöitä, limetinlohkoja ja hienonnettua chiliä.",
    "Ingredients": "Pirkka luomu tofua\nPirkka broilerin fileesuikaleita, maustamaton\nrypsiöljyä\nvalkosipulinkynttä hienonnettuna\nkananmuna\nmungpavun ituja\nporkkana suikaleina\nkevätsipulin varsi\nvettä\nPirkka riisinuudeleita\nosterikastiketta\nsokeria\nviinietikkaa\nkalakastiketta\nPirkka kuorittuja maapähkinöitä\nlimetinlohkoja\nPirkka mieto punainen chili"
  },
  {
    "Id": 10457,
    "Name": "Banaanileipä eli banana bread",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10457?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Voitele suorakaiteen mallinen, litran vetoinen leipävuoka.\n# Muussaa banaanit haarukalla.\n# Sekoita kulhossa hieman jäähtynyt voisula, sokerit, muna ja banaanisose.\n# Sekoita kuivat aineet keskenään ja kääntele taikinaan.\n# Kaada taikina vuokaan. Valuta leivän päälle siirappia ja koristele leipä halkaistulla banaanilla ja pähkinöillä.\n# Paista banaanileipää 175-asteisen uunin keskitasolla 50 minuuttia. Peitä leipä tarvittaessa leivinpaperilla, jos se tummuu liikaa.\n# Anna banaanileivän jäähtyä ennen kuin irrotat sen vuoasta.\n# Tarjoa banaanileipä esimerkiksi pähkinävoin kanssa.",
    "Ingredients": "kypsää banaania\nvoisulaa\nfariinisokeria\nsokeria\nkananmuna\nvehnäjauhoja\nkaurahiutaleita\nPirkka pekaanipähkinää\nrusinoita\nvaniljasokeria\nkanelia\nkardemummaa\nPirkka ruokasoodaa\nsuolaa\nPirkka vaahterasiirappia\nbanaani\nPirkka pekaanipähkinöitä"
  },
  {
    "Id": 10456,
    "Name": "Kurpitsaleipä tuorejuustotäytteellä",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10456?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/1e1cz8MzS0E",
    "Instructions": "# Kuori ja kuutioi myskikurpitsa. Poista siemenet. Paahda kurpitsakuutioita 175-asteisessa uunissa noin 25 minuuttia. Soseuta kurpitsa. Mittaa leipää varten 300 g (n. 3 dl) kurpitsasosetta.\n# Vuoraa leipävuoka (tilavuus 2 l) leivinpaperilla.\n# Sekoita kuivat aineet keskenään kulhossa. Vatkaa toisessa kulhossa muna, valkuainen ja sokeri vaaleaksi vaahdoksi.\n# Lisää öljy ohuena nauhana muna-sokeriseokseen samalla koko ajan sekoittaen. Sekoita joukkoon kurpitsasose ja kääntele taikinaan lopuksi myös kuivat aineet.\n# Sekoita kaikki tuorejuustotäytteen ainekset kulhossa.\n# Kaada vuoan pohjalle noin kolmasosa taikinasta. Levitä päälle puolet tuorejuustotäytteestä niin, että reunoille jää yli sentin tila ilman täytettä. Toista uudestaan: levitä päälle puolet lopusta taikinasta ja loput täytteestä. Peitä lopuksi lopulla taikinalla.\n# Paista kurpitsaleipää 175-asteisen uunin alatasolla noin tunnin ajan. Anna kurpitsaleivän jäähtyä vuoassa.",
    "Ingredients": "myskikurpitsaa\nPirkka vehnäjauhoja\nleivinjauhetta\nkanelia\ninkivääriä\nsuolaa\njauhettua muskottipähkinää\nkananmuna\nkananmunan valkuainen\nsokeria\nPirkka rypsiöljyä\nPirkka maustamatonta tuorejuustoa\nkananmunan keltuainen\nsokeria\nvehnäjauhoja\nPirkka vaniljasokeria"
  },
  {
    "Id": 10455,
    "Name": "Soseutettu sipulikeitto",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10455?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/-T6FemKggd8",
    "Instructions": "# Kuori ja leikkaa sipulit ohuiksi renkaiksi. Kuori ja viipaloi valkosipulinkynnet.\n# Kuumenna öljy isossa kattilassa. Kuullota sipuleita noin 10 minuuttia. Lisää hunaja, timjami sekä pippuri ja kääntele sekaisin.\n# Kaada kattilaan olut, vesi ja murennetut kasvisliemikuutiot ja anna kiehua hiljalleen puoli tuntia ilman kantta.\n# Tee krutongit. Leikkaa valkosipulinkynsi viipaleiksi ja patonki noin sentin paksuisiksi paloiksi. Kuumenna öljy ja valkosipuli pannulla. Paista leipäkuutiot rapeiksi öljyssä.\n# Soseuta sipulikeitto sauvasekoittimella. Tarkista maku ja lisää tarvittaessa suolaa.",
    "Ingredients": "Pirkka sipulia\nvalkosipulinkynttä\nPirkka ekstra-neitsytoliiviöljyä\nhunajaa\ntuoretta timjamia\nmustapippuria\nPirkka I-olutta (2,7%)\nvettä\nkasvisliemikuutiota\nvalkosipulinkynsi\nPirkka ranskalaista jättipatonkia\nPirkka ekstra-neitsytoliiviöljyä"
  },
  {
    "Id": 10454,
    "Name": "Punajuuri-vuohenjuustokeitto",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10454?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Kuori ja paloittele punajuuret, punasipulit ja valkosipulinkynnet.\n# Kuullota sipulit oliiviöljyssä isossa kattilassa. Lisää punajuuret, vesi ja murennetut kasvisliemikuutiot.\n# Keitä punajuuria ja sipuleita kasvisliemessä noin 40 minuuttia, kunnes punajuuret ovat kypsiä.\n# Lisää vuohenjuusto, ruokakerma, hunaja ja balsamietikkakastike. Keitä hiljalleen sekoitellen, kunnes juusto sulaa.\n# Soseuta keitto sauvasekoittimella.\n# Koristele punajuuri-vuohenjuustokeitto herneenversoilla ja siemenillä.",
    "Ingredients": "Pirkka punajuuria\npunasipulia\nvalkosipulinkynttä\nPirkka ekstra-neitsytoliiviöljyä\nvettä\nKnorr Luomu kasvisliemikuutiota\nvuohenmaitotuorejuustoa (Chavroux)\nPirkka laktoositonta ruokakermaa (15 %)\nhunajaa\nPirkka tummaa balsamietikkakastiketta\nherneenversoja\nPirkka salaattisiemensekoitusta"
  },
  {
    "Id": 10453,
    "Name": "Uuniperunat ja lämmin kinkku-pinaattikastike",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10453?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Harjaa perunat puhtaiksi ja pistele perunat haarukalla. Pyöräytä perunat öljyssä ja paista 200 asteessa noin tunti.\n# Viipaloi valkosipulinkynnet ja kuullota ne öljyssä. Lisää pannulle kohmeinen lehtipinaatti ja paista sekoitellen muutama minuutti. Kaada pannulle fraiche-kerma ja kuumenna kiehuvaksi.\n# Viipaloi kinkku ja raasta juusto. Lisää kinkku ja puolet juustosta pannulle. Mausta mustapippurilla.\n# Tee kypsiin perunoihin ristiviilto ja purista perunaa, niin että peruna aukeaa. Jaa täyte perunoille ja ripottele pinnalle loput juustosta.",
    "Ingredients": "Pirkka Rosamunda uuniperunaa (violetti pussi)\nvalkosipulinkynttä\nrypsiöljyä\nPirkka lehtipinaattia (pakaste)\nArla Lempi Fraîche -kermaa\nPirkka Parhaat ylikypsää uunikinkkua\nArla Passeli Port Salut -juustoa\nmustapippuria"
  },
  {
    "Id": 10452,
    "Name": "Tex mex -bataattivuoka",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10452?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Pese, kuori ja leikkaa bataatti ohuiksi puolikuiksi. Kuori ja suikaloi punasipulit.\n# Voitele iso uunivuoka ja levitä siihen bataatit sekä sipulit.  Mausta suolalla ja pippurilla. Paista 225-asteisessa uunissa 15-20 minuuttia, kunnes bataatit ovat pehmenneet.\n# Sekoita Härkiksen joukkoon tacokastike ja cayennepippuri. Huuhdo ja valuta pavut.\n# Nosta vuoka uunista ja säädä lämpö grillivastukselle 225 asteeseen. Lisää vuokaan ensin pavut ja 1/3 juustosta. Lisää sitten Härkis-seos. Ripottele pinnalle loput juustoraasteesta.\n# Paista vielä noin 8 minuuttia. Suikaloi chilit ja ripottele ne valmiin ruoan pinnalle.",
    "Ingredients": "bataatti\npunasipulia\nsuolaa\nmustapippuria\nVerso Härkistä (Original)\nPirkka mietoa tacokastiketta\ncayennepippuria tai chilijauhetta\nPirkka mustapapuja\nPirkka emmental-mozzarellajuustoraastetta\nPirkka mietoa punaista chiliä\nvoita paistoastian voiteluun"
  },
  {
    "Id": 10451,
    "Name": "Paahdettu kalkkuna",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10451?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Nosta kalkkuna sulamaan jääkaappiin vähintään kaksi päivää aiemmin.\n# Pyyhi kalkkunan pinta kuivaksi. Käännä kalkkuna leikkuulaudalle rintapuoli alaspäin. Leikkaa tukevilla keittiö- tai lintusaksilla molemmin puolin selkärankaa niin, että selkäranka irtoaa. Pyyhi sisus kuivaksi.\n# Käännä lintu rintapuoli ylöspäin ja paina napakasti rintalastan kohdalta, jotta ranka litistyy. Leikkaa tukevalla ja terävällä keittiöveitsellä kalkkuna puoliksi rintalastan suuntaisesti. Mausta suolalla ja pippurilla. Nosta kalkkunanpuolikkaat korkeareunaiselle uunipannulle.\n# Leikkaa valkosipulit leveyssuunnassa puoliksi. Mittaa vesi, kanafondi, mustaherukkahyytelö, vaahterasiirappi, sinappi, rosmariini ja laakerinlehdet kattilaan. Kuumenna kiehuvaksi, sekoita välillä. Kaada liemi uunipannulle ja lisää puolitetut valkosipulit.\n# Työnnä paistolämpömittari kalkkunan pulleimpaan kohtaan. Peitä kalkkuna foliolla. Paista 175-asteisessa uunissa noin 1 tunti. Poista folio ja valele kalkkunaa vuokaan kertyneellä nesteellä 15 minuutin välein, kunnes kalkkuna on kypsä. Paistoaika on yhteensä noin 2 t 30 min. Ota kalkkuna uunista, kun lihasneste on kirkasta ja sisälämpötila 70-72 astetta. Lämpö nousee vielä muutaman asteen uunista ottamisen jälkeen.\n# Nosta kalkkunapuolikkaat vuoasta tarjoiluvadille. Peitä löyhästi foliolla ja anna vetäytyä noin 15 minuuttia.\n# Lisää valkosipulit tarjoiluvadille ja kaada liemi kannuun. Tarjoa valkosipulit ja kastike kalkkunan kanssa.",
    "Ingredients": "Pirkka suomalainen pakastettu kalkkuna\nsuolaa\nmustapippuria\nkokonaista valkosipulia\nvettä\nPirkka kanafondia\nPirkka Parhaat mustaherukkahyytelöä\nPirkka vaahterasiirappia\nPirkka Dijon-sinappia\noksaa tuoretta rosmariinia\nlaakerinlehteä"
  },
  {
    "Id": 10449,
    "Name": "Lohiramen",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10449?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Keitä munia noin 7 minuuttia ja jäähdytä ne. Kuori ja halkaise munat.\n# Mittaa kattilaan vesi ja fondi. Kuumenna kiehuvaksi.\n# Kuori ja suikaloi inkivääri sekä viipaloi valkosipulinkynnet. Lisää ne kattilaan. Anna liemen kiehua noin 10 minuuttia.\n# Valmista sillä aikaa nuudelit pakkauksen ohjeen mukaan. Valuta ja sekoita joukkoon rypsiöljy.\n# Paloittele lohifilee neljään palaan. Aloita paistaminen nahkapuolelta. Paahda kalapaloja pannulla molemmin puolin yhteensä 4-5 minuuttia. Valuta päälle 1 rkl soijakastiketta.\n# Rullaa suippopaprikaa kevyesti leikkuulautaa vasten, leikkaa kanta ja kopista siemenet pois. Viipaloi paprikat. Suikaloi kevätsipulit\n# Mausta ramenliemi lopulla soijakastikkeella (3 rkl) ja riisiviinietikalla.\n# Jaa nuudelit isoihin kulhoihin. Kaada päälle kuumaa lientä ja lisää paprikaa, keväsipulia, kananmunat ja lohipala. Viimeistele annokset kevätsipulilla ja iduilla. Tarjoa heti.",
    "Ingredients": "Pirkka Luomu kananmunaa\nvettä\nPirkka kasvisfondia\ntuoretta inkivääriä\nvalkosipulinkynttä\nPirkka Parhaat lasinuudelia\nrypsiöljyä\nlohifileetä\nPirkka japanilaista soijakastiketta\nPirkka suippopaprikaa\nPirkka kevätsipulia\nPirkka riisiviinietikkaa\nAlfalfa silmusalaattia tai ituja"
  },
  {
    "Id": 10448,
    "Name": "Joulumakkara lanttupedillä",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10448?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Laita vesi kiehumaan lanttuja varten. Kuori ja paloittele lantut noin sentin kuutioiksi. Keitä suolalla maustetussa vedessä kypsiksi, 20-25 minuuttia.\n# Kuumenna sillä aikaa öljy pannulla ja paista siinä matalalla lämmöllä makkarakieppiä molemmin puolin käännellen 8-10 minuuttia.\n# Valuta lantut huolellisesti ja anna kuivahtaa siivilässä. Kuumenna kerma ja voi pienessä kattilassa. Siirrä lantut takaisin keittokattilaan, kaada päälle kermaseos ja survo survimella rouheaksi. Sekoita joukkoon oarmesaaniraaste ja mausteet.\n# Levitä lanttusose tarjoiluastiaan ja nosta päälle makkara. Ripottele päälle kaprikset. Tarjoa halutessasi lisäksi sinappia.",
    "Ingredients": "HK maakarit Juhla raakamakkaraa\nrypsiöljyä\nPirkka pestyä lanttua\nPirkka kuohukermaa tai ruokakermaa\nvoita\nPirkka Parhaat parmesaania raastettuna\nsuolaa\nmustapippuria\nPirkka kapriksia"
  },
  {
    "Id": 10447,
    "Name": "Olutglögi",
    "PieceSize_Unit": "ml",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10447?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Mittaa teräskattilaan olut, sokeri ja mausteet. Kuumenna miedolla lämmöllä, kunnes sokeri on sulanut ja olut kuumaa. Älä kuumenna kiehuvaksi.\n# Pese appelsiini huolellisesti ja viipaloi se kuorineen. Poista kanelitanko glögistä.\n# Jaa juoma kuumaa kestäviin laseihin. Viimeistele appelsiiniviipaleella ja ripauksella kanelia. Tarjoa kuumana.",
    "Ingredients": "Pirkka Parhaat Amber Ale -olutta\nfariinisokeria\nkanelitanko\njauhettua inkivääriä\njauhettua neilikkaa\nmuskottipähkinää\nPirkka (Luomu)appelsiini\nPirkka Luomu kanelia"
  },
  {
    "Id": 10446,
    "Name": "Joulukana ja punakaalipihvit",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10446?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Ota broileri huoneenlämpöön tunti ennen valmistusta.\n# Pese yksi klementiini huolellisesti ja leikkaa se puoliksi. Täytä broileri klementiinin puolikkailla ja sido broilerin jalat narulla. Typistä siiven kärjet saksilla, jotta ne eivät pala.\n# Nosta broileri uunivuokaan rintapuoli ylöspäin. Paista ensin 200 asteessa 15 minuuttia. Nosta vuoka uunista, käännä broileri selkä ylöspäin ja jatka paistamista 175 asteessa 25 minuuttia.\n# Pese ja viipaloi toinen klementiini. Nosta vuoka uunista, paina klementiiniviipaleet kanan päälle ja jatka vielä kypsentämistä 30 minuuttia, kunnes broilerin sisälämpötila on 75 astetta. Voit valella vuokaan kertynyttä lientä broilerin päälle. Peitä kypsä broileri löyhästi foliolla ja anna vetäytyä.\n# Poista kaalista tarvittaessa rikkoutuneet ulkolehdet. Leikkaa kaalin keskeltä kannan kohdalta ja vähän molemmin puolin 4 kiekkoa (paksuus noin 2 cm). Nosta leivinpaperin päälle uunipellille ja voitele öljyllä. Mausta suolalla ja paista 200 asteessa 30-35 minuuttia.\n# Paahda pekaanipähkinät pannulla, jäähdytä ja rouhi veitsellä. Sekoita kulhossa keskenään pähkinärouhe, klementiinin mehu- ja kuoriraaste, öljy ja vaahterasiirappi sekä mausteet. Lisää lopuksi hienonnettu lehtipersilja ja sulatetut granaattiomenan siemenet.\n# Siirrä kaalipihvit tarjoilulautaselle, levitä päälle kastike ja tarjoa broilerin kanssa.",
    "Ingredients": "Kariniemen Juhla Kananpoika\nklementiiniä\npunakaali\nPirkka rypsiöljyä\nsuolaa\nPirkka pekaanipähkinöitä\nklementiinin raastettu kuori\nklementiininmehua\nPirkka ekstra-neitsytoliiviöljyä\nPirkka vaahterasiirappia\nsuolaa\nmustapippuria\nlehtipersiljaa hienonnettuna\nPirkka granaattiomenan siemeniä (pakaste)"
  },
  {
    "Id": 10445,
    "Name": "Porotartar",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10445?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Laita jäiset karpalot kulhoon. Mittaa kattilaan etikka, vesi, sokeri, katajanmarjat ja suola. Keitä, kunnes sokeri on sulanut. Kaada kuuma liemi karpaloiden päälle. Jäähdytä ja nosta jääkaappiin odottamaan.\n# Nosta jäiset porofileet jääkaappiin 30-45 minuutiksi, kunnes ne ovat sulaneet kohmeisiksi.\n# Sekoita majoneesin joukkoon hienonnettu rosmariini.\n# Poista lihasta tarvittaessa kalvot. Leikkaa kohmeinen poron filee ensin viipaleiksi ja sitten pieniksi kuutioiksi. Sekoita joukkoon mausteet.\n# Muotoile lihasta annokset lautasille. Paina lusikalla tartarin keskelle kuoppa ja aseta siihen keltuainen. Annostele lautasille karpaloita ja lusikallinen majoneesia. Koristele annokset versoilla.",
    "Ingredients": "Pirkka Parhaat poron sisäfileetä (pakaste)\nworcestershire-kastiketta\nPirkka Parhaat sormisuolaa\nmustapippuria\nPirkka Luomu kananmunan keltuaista\nHellmann's majoneesia\nrosmariinia hienonnettuna\nkarpaloita (pakaste)\nomenaviinietikkaa\nvettä\nsokeria\nkatajanmarjaa murskattuna\nsuolaa\nversoja"
  },
  {
    "Id": 10443,
    "Name": "Kummituskakku",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10443?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Pingota leivinpaperi irtopohjavuoan (Ø 18-20 cm) pohjan ja reunan väliin. Voitele reunat. Keitä ja jäähdytä kahvi.\n# Vatkaa munat ja sokeri sähkövatkaimella paksuksi, vaaleaksi vaahdoksi.\n# Sulata voi. Yhdistä kuivat aineet ja rouhi tumma suklaa joukkoon. Kaada 1 dl kahvia taikinaan, säästä loppu kakun kostutukseen. Kääntele kahvi, voi ja kuivat aineet muna-sokerivaahtoon.\n# Kaada taikina vuokaan. Kypsennä 175-asteisessa uunissa noin 1 tunti 15 minuuttia minuuttia, kunnes kakku on vielä kostea mutta kypsä. Anna jäähtyä.\n# Kakun kypsyessä tee kummitukset. Tarvitset siihen pullasudin tai muun pensselin. Sulata valkosuklaa mikrossa lyhyissä jaksoissa, välillä sekoittaen. Levitä leivipaperi suurelle leikkuulaidalle, niin koristeita on helppo siirrellä. Laita lusikallinen suklaata leivinpaperille, läikkä saa levitä hieman sutia leveämmäksi. Vedä suklaa sudilla kummituksen muotoiseksi. Laita kummitukselle sokerisilmät. Muotoile loppu suklaa kummituksiksi. Nosta jääkaappiin jähmettymään.\n# Tee täyte. Vaahdota voi, tomusokeri ja maito sähkövatkaimella kuohkeaksi. Vatkaa tuorejuusto joukkoon. Värjää täyte 1 tl:lla elintarvikeväriä.\n# Leikkaa jäähtynyt kakku 4 kerrokseen. Kostuta kerrokset kevyesti kahvilla ja täytä hillolla ja ohuelti tuorejuustokuorrutteella. Levitä lähes kaikki loppu kuorrute kakun päälle. Sekoita muutama tippa elintarvikeväriä jäljellä olevaan kuorrutteeseen ja levitä kakulle, niin saat marmoroituneen pinnan.\n# Irrota kummitukset varovasti leivinpaperista ja paina kakun pintaan. Nosta kakku jääkaappiin tarjoamiseen asti.",
    "Ingredients": "kananmunaa\nsokeria\nvahvaa kahvia\nPirkka voita\nvehnäjauhoja\nPirkka kaakaojauhetta (tummaa)\nleivinjauhetta\nkardemummaa\nsuolaa\nPirkka tummaa leivontasuklaata (70 %)\nPirkka voita huoneenlämpöisenä\ntomusokeria\nmaitoa\nPirkka maustamatonta tuorejuustoa\noranssia elintarvikeväriä (Dr. Oetker)\nPirkka aprikoosihilloa\nPirkka valkoista leivontasuklaata\nDr. Oetker Sugar eyes -sokerisilmiä"
  },
  {
    "Id": 10429,
    "Name": "Vadelmapavlova",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10429?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Erottele keltuaiset ja valkuaiset. Riko valkuaisten rakenne kulhossa. Lisää sokeri valkuaisten joukkoon vähitellen, koko ajan voimakkaasti sätkövatkaimella vatkaten. Vatkaa seosta, kunnes se on kiiltävän valkoista, paksua ja jähmeää. Lisää lopuksi etikka ja perunajauhot ja vatkaa vielä pari minuuttia.\n# Vuoraa uunipelti leivinpaperilla. Levitä marenkivaahto ympyrän (⌀ noin 25 cm) muotoon leivinpaperin päälle. Tee reunoista hieman keskustaa paksummat.\n# Kuivata marenkia 100-asteisessa uunissa 2 tuntia. Marengin tulee olla pinnalta kuiva, mutta sisältä pehmeä kuin vaahtokarkki. Anna marengin jäähtyä.\n# Vatkaa kuohukerma jämäkäksi vaahdoksi. Kaada joukkoon jogurtti sekä sokeri ja vatkaa tasaiseksi.\n# Levitä jogurttivaahto marengille. Koristele pavlova aavistuksen kohmeisilla vadelmilla, hunajalla ja halutessasi vielä tuoreella mintulla ja syötävillä kukilla.",
    "Ingredients": "Pirkka Parhaat ulkokanojen munien valkuaista\nsokeria\nvalkoviinietikkaa\nperunajauhoja\nPirkka kuohukermaa\nPirkka Parhaat suomalaista jogurttia\nsokeria\nPirkka Parhaat suomalaisia vadelmia (pakaste)\njuoksevaa hunajaa\ntuoretta minttua\nsyötäviä kukkia"
  },
  {
    "Id": 10428,
    "Name": "Italialainen pasta carbonara",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10428?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Suikaloi pekoni. Lisää pekoni kylmälle pannulla ja paista miedohkolla lämmöllä, kunnes pekonista alkaa rasva irrota. Jatka kuumentamista, kunnes pekoni on kypsää. Siirrä pannu liedeltä.\n# Keitä sillä aikaa spagetti suolalla maustetussa vedessä pakkauksen ohjeen mukaan.\n# Vatkaa kananmunien rakenne rikki ja mausta mustapippurilla. Raasta juusto raastimen pienellä terällä.\n# Kun pasta on kypsää, ota keitinvettä talteen 1-2 dl. Valuta pasta ja siirrä se valmiiksi lämmitettyyn kulhoon.\n# Lisää pastan joukkoon pekoni ja sekoita. Kaada kananmunat pastan joukkoon koko ajan vatkaten ja ripottele heti perään puolet juustoraasteesta. Tässä vaiheessa voit lisätä keitinvettä.\n# Lisää loput juustosta huolellisesti sekoittaen. Pastan tulisi olla kiiltävän kosteaa, mutta kulhonpohjalla ei saisi olla runsaasti lientä. Lisää keitinvettä, jos koostumus on liian kuiva. Rouhi lopuksi joukkoon runsaasti mustapippuria ja lisää suolaa tarvittaessa. Tarjoa heti.",
    "Ingredients": "Pirkka spagettia\nPirkka pekonia\nPirkka Luomu kananmunaa\nmustapippuria\nPirkka Parhaat parmesaania\n(suolaa)"
  },
  {
    "Id": 10427,
    "Name": "Ahvenfileet",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10427?w=1000&h=1000&fit=clip",
    "VideoUrl": "https://youtu.be/zY7p23AvcYY",
    "Instructions": "# Kuori ja leikkaa juurekset pieniksi paloiksi. Pane juurekset ja suola kattilaan ja kaada vettä sen verran, että juurekset juuri ja juuri peittyvät. Keitä juurekset kypsiksi, 20-25 minuuttia. Valuta enin keitinliemi juureksista kulhoon ja ota se talteen. Lisää voi juuresten joukkoon ja survo juurekset muusiksi. Ohenna muusi keitinliemellä sopivan paksuiseksi.\n# Valmista ruskistettu voi. Paloittele voi paksupohjaiseen kattilaan. Sulata ja kuumenna voi. Ensin se vaahtoaa jonkin verran. Kuumentuessa voista haihtuu vesi ja se alkaa ruskistua. Sekoita voita välillä, jotta huomaat voin ruskistumisasteen. Voin paahtuminen kestää 7-10 minuuttia. Voi on valmista, kun se on paahtuneen ruskeaa. Ota kattila liedeltä ja kaada voi kulhoon. Lisää joukkoon hienonnetut fenkolinsiemenet ja sitruunan kuoriraaste.\n# Kuumenna voi pannulla, ja kun se hieman vaahtoaa, asettele ahvenfileet pannulle. Käännä fileet, kun reunat hieman ruskistuvat. Ahvenfileet kypsyvät muutamassa minuutissa. Ripottele fileiden pinnalle suolaa. Ahvenfileet kannattaa paistaa juuri ennen tarjoamista, periaatteena pannulta lautaselle.\n# Valuta ruskistettua voita ahvenfileille ennen tarjoamista. Koristele ahvenfileet halutessasi syötävillä kukilla. Tarjoa ahvenfileiden lisänä juuresmuusia ja syksyn värikkäitä kasviksia.",
    "Ingredients": "ahvenfileitä\nvoita\nsuolaa\nvoita\nfenkolinsiemeniä huhmaressa hienonnettuna\nsitruunankuorta raastettuna\n(kehäkukan terälehtiä)\nporkkanoita\nperunoita\npalsternakkaa\nselleriä\nsuolaa\nvoita"
  },
  {
    "Id": 10423,
    "Name": "Paahdettu hedelmäsalaatti",
    "PieceSize_Unit": "g",
    "PieceSize_Amount": "",
    "PictureUrl": "https://k-file-storage-qa.imgix.net/f/k-ruoka/recipe/10423?w=1000&h=1000&fit=clip",
    "VideoUrl": "None",
    "Instructions": "# Halkaise luumut, poista kivet ja leikkaa luumut puoliksi tai neljään osaan. Kuori ananas, poista kova keskiosa ja leikkaa ananas reiluiksi paloiksi.\n# Halkaise chilipalko, poista siemenet ja hienonna chili. Halkaise myös vaniljatanko ja kaavi sen siemenet talteen.\n# Sekoita sokerin joukkoon chili, vaniljatangon sisus, limetin kuori ja mehu. Levitä hedelmät uunivuokaan ja ripottele maustettu sokeri hedelmien pinnalle.\n# Paahda 200-asteisessa uunissa noin 20 minuuttia. Ripottele pistaasipähkinät hedelmäsalaatin pinnalle. Tarjoa hedelmäsalaatti hieman jäähtyneenä sellaisenaan tai vaniljajäätelön kanssa.",
    "Ingredients": "luumuja\nPirkka Luomu Reilun kaupan ananas\nPirkka mieto punainen chili\nhalkaistu vaniljatanko\nlimetinkuorta raastettuna\nlimetinmehua\nsokeria\nPirkka paahdettuja ja suolattuja pistaasipähkinöitä rouhittuna"
  }
]